[FirstLW X2SoldierClassTemplate]
DisplayName="FirstLW"
ClassSummary="The Ranger serves as our primary reconnaissance unit, capable of moving independently in concealment while engaging enemies at close range."
LeftAbilityTreeTitle="Scout"
RightAbilityTreeTitle="Assault"
AbilityTreeTitles[0]="Scout"
AbilityTreeTitles[1]="Assault"
AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="Bandit"
RandomNickNames[1]="Blitz"
RandomNickNames[2]="Brick"

[SecondLW X2SoldierClassTemplate]
DisplayName="SecondLW"
ClassSummary="The Ranger serves as our primary reconnaissance unit, capable of moving independently in concealment while engaging enemies at close range."
LeftAbilityTreeTitle="Scout"
RightAbilityTreeTitle="Assault"
AbilityTreeTitles[0]="Scout"
AbilityTreeTitles[1]="Assault"
AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="Bandit"
RandomNickNames[1]="Blitz"
RandomNickNames[2]="Brick"

[ThirdLW X2SoldierClassTemplate]
DisplayName="ThirdLW"
ClassSummary="The Ranger serves as our primary reconnaissance unit, capable of moving independently in concealment while engaging enemies at close range."
LeftAbilityTreeTitle="Scout"
RightAbilityTreeTitle="Assault"
AbilityTreeTitles[0]="Scout"
AbilityTreeTitles[1]="Assault"
AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="Bandit"
RandomNickNames[1]="Blitz"
RandomNickNames[2]="Brick"

[FourthLW X2SoldierClassTemplate]
DisplayName="FourthLW"
ClassSummary="The Ranger serves as our primary reconnaissance unit, capable of moving independently in concealment while engaging enemies at close range."
LeftAbilityTreeTitle="Scout"
RightAbilityTreeTitle="Assault"
AbilityTreeTitles[0]="Scout"
AbilityTreeTitles[1]="Assault"
AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="Bandit"
RandomNickNames[1]="Blitz"
RandomNickNames[2]="Brick"

[FifthLW X2SoldierClassTemplate]
DisplayName="FifthLW"
ClassSummary="The Ranger serves as our primary reconnaissance unit, capable of moving independently in concealment while engaging enemies at close range."
LeftAbilityTreeTitle="Scout"
RightAbilityTreeTitle="Assault"
AbilityTreeTitles[0]="Scout"
AbilityTreeTitles[1]="Assault"
AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="Bandit"
RandomNickNames[1]="Blitz"
RandomNickNames[2]="Brick"

[SixthLW X2SoldierClassTemplate]
DisplayName="SixthLW"
ClassSummary="The Ranger serves as our primary reconnaissance unit, capable of moving independently in concealment while engaging enemies at close range."
LeftAbilityTreeTitle="Scout"
RightAbilityTreeTitle="Assault"
AbilityTreeTitles[0]="Scout"
AbilityTreeTitles[1]="Assault"
AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="Bandit"
RandomNickNames[1]="Blitz"
RandomNickNames[2]="Brick"

;************************************************************************************************************
;XComGame.int - This File manages the names of custom classes, their descriptions & also their nicknames.
;In Addition custom soldier rank names can be applied here if you want to differ from normal xcom.
;************************************************************************************************************

;************************************************************************************************************
; ASSAULT
;************************************************************************************************************
[LWOTC_Assault X2SoldierClassTemplate]
+DisplayName="Assault"
+ClassSummary="The Assault serves as our primary close range unit, able to push in close and hold the line."
+LeftAbilityTreeTitle="Raider"
+RightAbilityTreeTitle="Breacher"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Bandit"
+RandomNickNames[1]="Blitz"
+RandomNickNames[2]="Brick"
+RandomNickNames[3]="Butcher"
+RandomNickNames[4]="Buzzsaw"
+RandomNickNames[5]="Cajun"
+RandomNickNames[6]="Chops"
+RandomNickNames[7]="Cobra"
+RandomNickNames[8]="Cougar"
+RandomNickNames[9]="Coyote"
+RandomNickNames[10]="Crash"
+RandomNickNames[11]="Diamond"
+RandomNickNames[12]="Enforcer"
+RandomNickNames[13]="Fatal"
+RandomNickNames[14]="Flash"
+RandomNickNames[15]="Fury"
+RandomNickNames[16]="Gator"
+RandomNickNames[17]="Ghost"
+RandomNickNames[18]="Gunner"
+RandomNickNames[19]="Hound Dog"
+RandomNickNames[20]="Ice"
+RandomNickNames[21]="Icepick"
+RandomNickNames[22]="Jaws"
+RandomNickNames[23]="Judgment Day"
+RandomNickNames[24]="Kinky"
+RandomNickNames[25]="Monster"
+RandomNickNames[26]="Mustang"
+RandomNickNames[27]="Paladin"
+RandomNickNames[28]="Pitbull"
+RandomNickNames[29]="Pathfinder"
+RandomNickNames[30]="Ringo"
+RandomNickNames[31]="Samurai"
+RandomNickNames[32]="Scorpion"
+RandomNickNames[33]="Shogun"
+RandomNickNames[34]="Shadow"
+RandomNickNames[35]="Slayer"
+RandomNickNames[36]="Snake"
+RandomNickNames[37]="Snake Eyes"
+RandomNickNames[38]="Solo"
+RandomNickNames[39]="Specter"
+RandomNickNames[40]="Spider"
+RandomNickNames[41]="Stalker"
+RandomNickNames[42]="Steel"
+RandomNickNames[43]="Stinger"
+RandomNickNames[44]="Templar"
+RandomNickNames[45]="Trojan"
+RandomNickNames[46]="Vandal"
+RandomNickNames[47]="Viking"
+RandomNickNames[48]="Warden"
+RandomNickNames[49]="Warlord"
+RandomNickNames[50]="Wolverine"
+RandomNickNames[51]="Wildchild"
+RandomNickNames[52]="Wildling"
+RandomNickNames[53]="Zulu"
;ALPHABETICAL ORDER
+RandomNickNames_Male[0]="Axeman"
+RandomNickNames_Male[1]="Duke"
+RandomNickNames_Male[2]="Rocky"
+RandomNickNames_Male[3]="Stallion"
+RandomNickNames_Male[4]="Wolfman"
;ALPHABETICAL ORDER
+RandomNickNames_Female[0]="Athena"
+RandomNickNames_Female[1]="Duchess"
+RandomNicknames_Female[2]="Iron Lady"
+RandomNicknames_Female[3]="Iron Maiden"
+RandomNicknames_Female[4]="Shieldmaiden"
+RandomNickNames_Female[5]="Valkyrie"
;ALPHABETICAL ORDER

************************************************************************************************************
; SHINOBI
;************************************************************************************************************
[LWOTC_Shinobi X2SoldierClassTemplate]
+DisplayName="Shinobi"
+ClassSummary="The Shinobi serves as our primary scouting unit, using a sword to deliver stealthy close-range attacks."
+LeftAbilityTreeTitle="Saboteur"
+RightAbilityTreeTitle="Kenshi"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Clutch"
+RandomNickNames[1]="Cobra"
+RandomNickNames[2]="Dagger"
+RandomNickNames[3]="Dancer"
+RandomNickNames[4]="Dasher"
+RandomNickNames[5]="Dodger"
+RandomNickNames[6]="Dragon"
+RandomNickNames[7]="Fencer"
+RandomNickNames[8]="Flipper"
+RandomNickNames[9]="Furball"
+RandomNickNames[10]="Gopher"
+RandomNickNames[11]="Mace"
+RandomNickNames[12]="Midnight"
+RandomNickNames[13]="Neutron"
+RandomNickNames[14]="Painter"
+RandomNickNames[15]="Pasha"
+RandomNickNames[16]="Poacher"
+RandomNickNames[17]="Rattler"
+RandomNickNames[18]="Razor"
+RandomNickNames[19]="Ripper"
+RandomNickNames[20]="Royal"
+RandomNickNames[21]="Shady"
+RandomNickNames[22]="Sticks"
+RandomNickNames[23]="Spacebar"
+RandomNickNames[24]="Splinter"
+RandomNickNames[25]="Stalker"
+RandomNickNames[26]="Talon"
+RandomNickNames[27]="Undertaker"
+RandomNickNames[28]="Wildcat"
;ALPHABETICAL ORDER
+RandomNickNames_Male[0]="Bender"
+RandomNickNames_Male[1]="Cochise"
+RandomNickNames_Male[2]="Slim"
+RandomNickNames_Male[3]="Jockey"
+RandomNickNames_Male[4]="Sandman"
+RandomNickNames_Male[5]="Swordsman"
;ALPHABETICAL ORDER
+RandomNickNames_Female[0]="Panther"
+RandomNickNames_Female[1]="Siren"
+RandomNickNames_Female[2]="Sparkplug"
+RandomNickNames_Female[3]="Spitfire"
;ALPHABETICAL ORDER

;************************************************************************************************************
; SHARPSHOOTER
;************************************************************************************************************
[LWOTC_Sharpshooter X2SoldierClassTemplate]
+DisplayName="Sharpshooter"
+ClassSummary="Our sharpshooters engage enemy targets with pinpoint accuracy from extreme range. They may also be trained as designated marksmen, forgoing long-range capabilities for mobility."
+LeftAbilityTreeTitle="Sniper"
+RightAbilityTreeTitle="Marksman"

;ALPHABETICAL ORDER
+RandomNickNames[0]="Apex"
+RandomNickNames[1]="Ace"
+RandomNickNames[2]="Aftermath"
+RandomNickNames[3]="Alpha"
+RandomNickNames[4]="Blackjack"
+RandomNickNames[5]="Bullseye"
+RandomNickNames[6]="Bolt"
+RandomNickNames[7]="Big Shot"
+RandomNickNames[8]="Big Sleep"
+RandomNickNames[9]="Big Time"
+RandomNickNames[10]="Boss"
+RandomNickNames[11]="Bullseye"
+RandomNickNames[12]="Checkmate"
+RandomNickNames[13]="Chief"
+RandomNickNames[14]="Colt"
+RandomNickNames[15]="Dallas"
+RandomNickNames[16]="Deadbolt"
+RandomNickNames[17]="Deadeye"
+RandomNickNames[18]="Deadlock"
+RandomNickNames[19]="Deadwood"
+RandomNickNames[20]="D.O.A."
+RandomNickNames[21]="Eagle Eye"
+RandomNickNames[22]="Eight Ball"
+RandomNickNames[23]="Flatline"
+RandomNickNames[24]="Game Time"
+RandomNickNames[25]="Gangster"
+RandomNickNames[26]="Grave Digger"
+RandomNickNames[27]="Hat Trick"
+RandomNickNames[28]="Hawkeye"
+RandomNickNames[29]="Heater"
+RandomNickNames[30]="High Noon"
+RandomNickNames[31]="Hitman"
+RandomNickNames[32]="Hollywood"
+RandomNickNames[33]="Hype"
+RandomNickNames[34]="Icon"
+RandomNickNames[35]="Jackal"
+RandomNickNames[36]="Judge"
+RandomNickNames[37]="Lights Out"
+RandomNickNames[38]="Lockdown"
+RandomNickNames[39]="Long Shot"
+RandomNickNames[40]="Longwalker"
+RandomNickNames[41]="Needle"
+RandomNickNames[42]="Pale Rider"
+RandomNickNames[43]="Reaper"
+RandomNickNames[44]="Scratch"
+RandomNickNames[45]="Serial"
+RandomNickNames[46]="Sheriff"
+RandomNickNames[47]="Shooter"
+RandomNickNames[48]="Showtime"
+RandomNickNames[49]="Slick"
+RandomNickNames[50]="Slinger"
+RandomNickNames[51]="Stonecold"
+RandomNickNames[52]="The Cleaner"
+RandomNickNames[53]="The Kid"
+RandomNickNames[54]="The Truth"
+RandomNickNames[55]="Tombstone"
+RandomNickNames[56]="Top Notch"
+RandomNickNames[57]="Top Shelf"
+RandomNickNames[58]="Two Tap"
+RandomNickNames[59]="Undertaker"
+RandomNickNames[60]="Valentine"
;ALPHABETICAL ORDER
+RandomNicknames_Male[0]="Cowboy"
+RandomNickNames_Male[1]="Godfather"
+RandomNickNames_Male[2]="Mailman"
+RandomNickNames_Male[3]="Sandman"
+RandomNickNames_Male[4]="Slim"
+RandomNickNames_Male[5]="Taxman"
+RandomNickNames_Male[6]="Zeus"
+RandomNickNames_Female[0]="Baroness"
+RandomNickNames_Female[1]="Black Widow"
+RandomNicknames_Female[2]="Calamity"
+RandomNicknames_Female[3]="Queen Bee"
;ALPHABETICAL ORDER

;************************************************************************************************************
; SPECIALIST
;************************************************************************************************************
[LWOTC_Specialist X2SoldierClassTemplate]
+DisplayName="Specialist"
+ClassSummary="Operating some of our most advanced equipment, Specialists deploy robotic drones on the battlefield that can be outfitted for combat or field medic duty."
+LeftAbilityTreeTitle="Medic"
+RightAbilityTreeTitle="Hacker"

;ALPHABETICAL ORDER
+RandomNickNames[0]="Angel"
+RandomNickNames[1]="Beta"
+RandomNickNames[2]="Bishop"
+RandomNickNames[3]="Bones"
+RandomNickNames[4]="Breaker"
+RandomNickNames[5]="Broker"
+RandomNickNames[6]="Crypto"
+RandomNickNames[7]="Cyber"
+RandomNickNames[8]="Cypher"
+RandomNickNames[9]="Data"
+RandomNickNames[10]="Deacon"
+RandomNickNames[11]="Dr. Feelgood"
+RandomNickNames[12]="Doc"
+RandomNickNames[13]="Feedback"
+RandomNickNames[14]="Firewall"
+RandomNickNames[15]="Genius"
+RandomNickNames[16]="Gizmo"
+RandomNickNames[17]="Glitch"
+RandomNickNames[18]="Hijack"
+RandomNickNames[19]="Jammer"
+RandomNickNames[20]="Jester"
+RandomNickNames[21]="Jolt"
+RandomNickNames[22]="Lightning"
+RandomNickNames[23]="Mayday"
+RandomNickNames[24]="Mega"
+RandomNickNames[25]="Newton"
+RandomNickNames[26]="Overdrive"
+RandomNickNames[27]="Patch"
+RandomNickNames[28]="Professor"
+RandomNickNames[29]="Ragtime"
+RandomNickNames[30]="Rascal"
+RandomNickNames[31]="Rattler"
+RandomNickNames[32]="Red"
+RandomNickNames[33]="Rift"
+RandomNickNames[34]="Ripcord"
+RandomNickNames[35]="Rogue"
+RandomNickNames[36]="Scorch"
+RandomNickNames[37]="Sentinel"
+RandomNickNames[38]="Shady"
+RandomNickNames[39]="Shakes"
+RandomNickNames[40]="Shifter"
+RandomNickNames[41]="Shrink"
+RandomNickNames[42]="Slider"
+RandomNickNames[43]="Solar"
+RandomNickNames[44]="Sonar"
+RandomNickNames[45]="Sparks"
+RandomNickNames[46]="Stitch"
+RandomNickNames[47]="Tapper"
+RandomNickNames[48]="Teardrop"
+RandomNickNames[49]="Tinker"
+RandomNickNames[50]="Turbo"
+RandomNickNames[51]="Venom"
+RandomNickNames[52]="Vapor"
+RandomNickNames[53]="Warbird"
+RandomNickNames[54]="Warden"
+RandomNickNames[55]="Whiskey"
+RandomNickNames[56]="Wild Thing"
+RandomNickNames[57]="Zulu"
;ALPHABETICAL ORDER
+RandomNickNames_Male[0]="Candyman"
+RandomNickNames_Male[1]="Magic Man"
+RandomNickNames_Male[2]="Priest"
+RandomNickNames_Male[3]="Rainman"
+RandomNickNames_Male[4]="Rooster"
+RandomNickNames_Female[0]="Priestess"
+RandomNickNames_Female[1]="Wolfmother"
+RandomNickNames_Female[2]="Black Widow"
+RandomNickNames_Female[4]="Duchess"
;ALPHABETICAL ORDER

;************************************************************************************************************
; GUNNER
;************************************************************************************************************
[LWOTC_Gunner X2SoldierClassTemplate]
+DisplayName="Gunner"
+ClassSummary="The Gunner is trained to use heavy automatic weapons, throwing a great mass of firepower at the enemy."
+LeftAbilityTreeTitle="SAW Gunner"
+RightAbilityTreeTitle="Machinegunner"

+RandomNickNames[0]="Backfire"
+RandomNickNames[1]="Baja"
+RandomNickNames[2]="Bearcat"
+RandomNickNames[3]="Brutal"
+RandomNickNames[4]="Chainsaw"
+RandomNickNames[5]="Flounder"
+RandomNickNames[6]="Gameshow"
+RandomNickNames[7]="Gonzo"
+RandomNickNames[8]="Hawker"
+RandomNickNames[9]="Kozmo"
+RandomNickNames[10]="Lunchbox"
+RandomNickNames[11]="Mangler"
+RandomNickNames[12]="Meathook"
+RandomNickNames[13]="Moose"
+RandomNickNames[14]="Nanook"
+RandomNickNames[15]="Nugget"
+RandomNickNames[16]="Nuke"
+RandomNickNames[17]="Ogre"
+RandomNickNames[18]="Pancake"
+RandomNickNames[19]="Panzer"
+RandomNickNames[20]="Piston"
+RandomNickNames[21]="Slinger"
+RandomNickNames[22]="Sparrow"
+RandomNickNames[23]="Spike"
+RandomNickNames[24]="Yogi"
+RandomNickNames[25]="Zarfer"
+RandomNickNames_Male[0]="Chuckles"
+RandomNickNames_Male[1]="Dingus"
+RandomNickNames_Male[2]="Maniac"
+RandomNickNames_Male[3]="Knuckles"
+RandomNickNames_Male[4]="Walrus"
+RandomNickNames_Female[0]="Bubbles"
+RandomNickNames_Female[1]="Gadget"
+RandomNickNames_Female[2]="Giggles"
+RandomNickNames_Female[3]="Mango"
+RandomNickNames_Female[4]="Pepper"


;************************************************************************************************************
; RANGER
;************************************************************************************************************
[LWOTC_Ranger X2SoldierClassTemplate]
+DisplayName="Ranger"
+ClassSummary="The Ranger is the master of the rifle and may be trained to use it in offensive and defensive capacities."
+LeftAbilityTreeTitle="Infantry"
+RightAbilityTreeTitle="Defender"

+RandomNickNames[0]="Bronco"
+RandomNickNames[1]="Buck"
+RandomNickNames[2]="Buckeye"
+RandomNickNames[3]="Cobalt"
+RandomNickNames[4]="Cowboy"
+RandomNickNames[5]="Digger"
+RandomNickNames[6]="Dinger"
+RandomNickNames[7]="Frosty"
+RandomNickNames[8]="Grunt"
+RandomNickNames[9]="Hollywood"
+RandomNickNames[10]="Hoss"
+RandomNickNames[11]="Howler"
+RandomNickNames[12]="Jaybird"
+RandomNickNames[13]="Jayhawk"
+RandomNickNames[14]="Judge"
+RandomNickNames[15]="Marlin
+RandomNickNames[16]="Mustang"
+RandomNickNames[17]="Pappy"
+RandomNickNames[18]="Painter"
+RandomNickNames[19]="Pinto"
+RandomNickNames[20]="Rascal"
+RandomNickNames[21]="Rocky"
+RandomNickNames[22]="Scooter"
+RandomNickNames[23]="Skeeter"
+RandomNickNames[24]="Skids"
+RandomNickNames[25]="Stretch"
+RandomNickNames[26]="Thumper"
+RandomNickNames[27]="Werewolf"
+RandomNickNames_Male[0]="Dusty"
+RandomNickNames_Male[1]="Dutch"
+RandomNickNames_Male[2]="Husker"
+RandomNickNames_Male[3]="Slick"
+RandomNickNames_Male[4]="Pops"
+RandomNickNames_Female[0]="Aunty"
+RandomNickNames_Female[1]="Goodnight"
+RandomNickNames_Female[2]="Medusa"
+RandomNickNames_Female[3]="Sugar"

;************************************************************************************************************
; GRENADIER
;************************************************************************************************************
[LWOTC_Grenadier X2SoldierClassTemplate]
+DisplayName="Grenadier"
+ClassSummary="Serving as our demolitions experts, the Grenadiers provide heavy ordnance delivery whenever and wherever we need it. They may also specialize in support grenades to protect our troops and disable our enemies."
+LeftAbilityTreeTitle="Boomer"
+RightAbilityTreeTitle="Support"

;ALPHABETICAL ORDER
+RandomNickNames[0]="All Day"
+RandomNickNames[1]="All In"
+RandomNickNames[2]="Animal"
+RandomNickNames[3]="Baller"
+RandomNickNames[4]="Big Country"
+RandomNickNames[5]="Big Money"
+RandomNickNames[6]="Big Nasty"
+RandomNickNames[7]="Blaze"
+RandomNickNames[8]="Boom Boom"
+RandomNickNames[9]="Bomber"
+RandomNickNames[10]="Buddy"
+RandomNickNames[11]="Bulldog"
+RandomNickNames[12]="Bull Rush"
+RandomNickNames[13]="Claymore"
+RandomNickNames[14]="Demo"
+RandomNickNames[15]="Defcon"
+RandomNickNames[16]="Devil Dog"
+RandomNickNames[17]="Diesel"
+RandomNickNames[18]="Encore"
+RandomNickNames[19]="Fireball"
+RandomNickNames[20]="Fridge"
+RandomNickNames[21]="Gunner"
+RandomNickNames[22]="Hammer"
+RandomNickNames[23]="Hellfire"
+RandomNickNames[24]="Hightower"
+RandomNickNames[25]="Hoss"
+RandomNickNames[26]="Volcano"
+RandomNickNames[27]="Hurricane"
+RandomNickNames[28]="Junkyard"
+RandomNickNames[29]="Juggernaut"
+RandomNickNames[30]="Knockout"
+RandomNickNames[31]="Kong"
+RandomNickNames[32]="Mad Dog"
+RandomNickNames[33]="Meltdown"
+RandomNickNames[34]="Moose"
+RandomNickNames[35]="Nova"
+RandomNickNames[36]="Nasty"
+RandomNickNames[37]="Nitro"
+RandomNickNames[38]="Overlord"
+RandomNickNames[39]="Pitbull"
+RandomNickNames[40]="Pyro"
+RandomNickNames[41]="Redline"
+RandomNickNames[42]="Rhino"
+RandomNickNames[43]="Rocket"
+RandomNickNames[44]="Seabreeze"
+RandomNickNames[45]="Slab"
+RandomNickNames[46]="Smash"
+RandomNickNames[47]="Spitfire"
+RandomNickNames[48]="Smokey"
+RandomNickNames[49]="Swamp Thing"
+RandomNickNames[50]="T-Bone"
+RandomNickNames[51]="T-Rex"
+RandomNickNames[52]="Tank"
+RandomNickNames[53]="Thumper"
+RandomNickNames[54]="Thunder"
+RandomNickNames[55]="Tickle"
+RandomNickNames[56]="Tiny"
+RandomNickNames[57]="Titan"
+RandomNickNames[58]="Dynamite"
+RandomNickNames[59]="Torch"
+RandomNickNames[60]="Wardog"
+RandomNickNames[61]="Warhorse"
+RandomNickNames[62]="Wildchild"
;ALPHABETICAL ORDER
+RandomNicknames_Male[0]="Barbarian"
+RandomNickNames_Male[1]="Big Boy"
+RandomNicknames_Male[2]="Boss Man"
+RandomNickNames_Male[3]="Cowboy"
+RandomNickNames_Male[4]="Meathead"
+RandomNickNames_Male[5]="Nero"
+RandomNickNames_Male[6]="Papa Bear"
+RandomNickNames_Male[7]="Wildman"
+RandomNickNames_Female[0]="Amazon"
+RandomNicknames_Female[1]="Boss Lady"
+RandomNickNames_Female[2]="Cowgirl"
+RandomNicknames_Female[3]="Domino"
+RandomNickNames_Female[4]="Freya"
+RandomNickNames_Female[5]="Mama Bear"
+RandomNickNames_Female[6]="Deep Six"
+RandomNickNames_Female[7]="Firebug"

;************************************************************************************************************
; TECHNICAL
;************************************************************************************************************
[LWOTC_Technical X2SoldierClassTemplate]
+DisplayName="Technical"
+ClassSummary="Serving as our demolitions experts, the Grenadiers provide heavy ordnance delivery whenever and wherever we need it. They may also specialize in support grenades to protect our troops and disable our enemies."
+LeftAbilityTreeTitle="Boomer"
+RightAbilityTreeTitle="Support"

[LWOTC_Psionic X2SoldierClassTemplate]
+DisplayName="Psionic"
+ClassSummary="A test class."
+LeftAbilityTreeTitle="A"
+RightAbilityTreeTitle="B"

[DepthPerceptionPCS X2EquipmentTemplate]
FriendlyName="PCS: Depth Perception"
FriendlyNamePlural="PCS: Depth Perception"
BriefSummary="This cybernetic implant grants 5 aim and reduces enemies' dodge by 25 when you are at a higher elevation than your target."

[HyperReactivePupilsPCS X2EquipmentTemplate]
FriendlyName="PCS: Hyper-Reactive Pupils"
FriendlyNamePlural="PCS: Hyper-Reactive Pupils"
BriefSummary="This implant confers +10 aim for your next shot with your primary weapon after a shot misses."

[CombatAwarenessPCS X2EquipmentTemplate]
FriendlyName="PCS: Combat Awareness"
FriendlyNamePlural="PCS: Combat Awareness"
BriefSummary="Grants 15 defense and half a point of armor (50% chance to reduce incoming damage by 1) when on overwatch."

[CombatRushPCS X2EquipmentTemplate]
FriendlyName="PCS: Combat Rush"
FriendlyNamePlural="PCS: Combat Rush"
BriefSummary="When you kill an enemy, allies within 7 tiles temporarily receive bonuses to aim, critical chance and mobility. Five-turn cooldown."

[DamageControlPCS X2EquipmentTemplate]
FriendlyName="PCS: Damage Control"
FriendlyNamePlural="PCS: Damage Control"
BriefSummary="The implant hardens your armor against enemy fire and grants two armor for two turns after you take damage."

[ImpactFieldsPCS X2EquipmentTemplate]
FriendlyName="PCS: Impact Fields"
FriendlyNamePlural="PCS: Impact Fields"
BriefSummary="This shield projector implant may be activated to reduce incoming damage by 33% for two turns."

[BodyShieldPCS X2EquipmentTemplate]
FriendlyName="PCS: Body Shield"
FriendlyNamePlural="PCS: Body Shield"
BriefSummary="The targeted enemy faces -20 aim and -50 critical chance against you."

[EmergencyLifeSupportPCS X2EquipmentTemplate]
FriendlyName="PCS: Emergency Life Support"
FriendlyNamePlural="PCS: Emergency Life Support"
BriefSummary="This implant ensures the first killing blow in a mission will not lead to instant death and extends bleed-out time by two turns."

[IronSkinPCS X2EquipmentTemplate]
FriendlyName="PCS: Iron Skin"
FriendlyNamePlural="PCS: Iron Skin"
BriefSummary="Incoming melee damage is reduced by 3."

[SmartMacrophagesPCS X2EquipmentTemplate]
FriendlyName="PCS: Smart Macrophages"
FriendlyNamePlural="PCS: Smart Macrophages"
BriefSummary="Reduces wound recovery time and grants immunity to acid and poison."

[LW2WotC_ShootAnyone X2AbilityTemplate]
LocFriendlyName="Shoot Anyone"
LocFlyOverText="Shoot Anyone"
LocLongDescription="Shoot Anyone."
LocHelpText="Shoot Anyone."
LocPromotionPopupText="<Bullet/> Shoot Anyone.<br/>"

[LW2WotC_CenterMass X2AbilityTemplate]
LocFriendlyName="Centre Mass"
LocFlyOverText="Centre Mass"
LocLongDescription="You do <Ability:CENTERMASS_DAMAGE/> additional point of base damage when using guns."
LocHelpText="You do <Ability:CENTERMASS_DAMAGE/> additional point of base damage when using guns."
LocPromotionPopupText="<Bullet/> You do <Ability:CENTERMASS_DAMAGE/> additional point of base damage with your primary weapon, pistols or a sawed-off shotgun."

[LW2WotC_Lethal X2AbilityTemplate]
LocFriendlyName="Lethal"
LocFlyOverText="Lethal"
LocLongDescription="You do <Ability:LETHAL_DAMAGE/> additional points of base damage with your primary weapon."
LocHelpText="You do <Ability:LETHAL_DAMAGE/> additional points of base damage with your primary weapon."
LocPromotionPopupText="<Bullet/> You do <Ability:LETHAL_DAMAGE/> additional points of base damage with your primary weapon."

[LW2WotC_HitandSlither X2AbilityTemplate]
LocFriendlyName="Hit and Slither"
LocFlyOverText="Hit and Slither"
LocLongDescription="Gain an additional move action after taking a standard shot at a flanked or exposed target with your primary weapon. <Ability:HNR_USES_PER_TURN/>"
LocHelpText="Gain an additional move action after taking a standard shot at a flanked or exposed target with your primary weapon. <Ability:HNR_USES_PER_TURN/>"
LocPromotionPopupText="<Bullet/> Gain an additional move action after taking a standard shot at a flanked or exposed target with your primary weapon. <Ability:HNR_USES_PER_TURN/>"

[LW2WotC_HitandRun X2AbilityTemplate]
LocFriendlyName="Hit and Run"
LocFlyOverText="Hit and Run"
LocLongDescription="Gain an additional action after taking a standard shot at a flanked or exposed target with your primary weapon. <Ability:HNR_USES_PER_TURN/>"
LocHelpText="Gain an additional action after taking a standard shot at a flanked or exposed target with your primary weapon. <Ability:HNR_USES_PER_TURN/>"
LocPromotionPopupText="<Bullet/> Cannot be used on the same turn as Run and Gun.<br/><Bullet/> Bonus full actions from Serial and Death from Above will be awarded first.<br/><Bullet/> <Ability:HNR_USES_PER_TURN/>"

[LW2WotC_CloseCombatSpecialist X2AbilityTemplate]
LocFriendlyName="Close Combat Specialist"
LocFlyOverText="Close Combat Specialist"
LocLongDescription="During enemy turns, fire a free reaction shot with your primary weapon at any visible enemy within <Ability:CCS_RANGE/> who moves or fires."
LocHelpText="During enemy turns, Fire a free reaction shot at any visible enemy within <Ability:CCS_RANGE/> who moves or fires."
LocPromotionPopupText="<Bullet/> Will not trigger if soldier is concealed.<br/><Bullet/> You may shoot at each enemy with this ability once per turn.<br/><Bullet/> Each shot requires <Ability:CCS_AMMO_PER_SHOT/> ammo.<br/>""

[LW2WotC_CloseCombatSpecialistAttack X2AbilityTemplate]
LocFriendlyName="Close Combat Specialist"
LocFlyOverText="Close Combat Specialist"
LocLongDescription="During enemy turns, fire a free reaction shot with your primary weapon at any visible enemy within <Ability:CCS_RANGE/> who moves or fires."
LocHelpText="During enemy turns, Fire a free reaction shot at any visible enemy within <Ability:CCS_RANGE/> who moves or fires."
LocPromotionPopupText="<Bullet/> Will not trigger if soldier is concealed.<br/><Bullet/> You may shoot at each enemy with this ability once per turn.<br/><Bullet/> Each shot requires <Ability:CCS_AMMO_PER_SHOT/> ammo.<br/>""

[LW2WotC_CloseandPersonal X2AbilityTemplate]
LocFriendlyName="Close and Personal"
LocFlyOverText="Close and Personal"
LocLongDescription="Confers +30 critical chance against adjacent targets. The bonus declines with distance from the target."
LocHelpText="Confers +30 critical chance against adjacent targets. The bonus declines with distance from the target."
LocPromotionPopupText="<Bullet/> Confers +30 critical chance against adjacent targets.<br/><Bullet/> Bonus reduced by 5% for each additional tile of distance from the target, down to 0% at 7 or more tiles.<br/>"

[LW2WotC_DamnGoodGround X2AbilityTemplate]
LocFriendlyName="Damn Good Ground"
LocFlyOverText="Damn Good Ground"
LocLongDescription="Confers +<Ability:DGG_AIM_BONUS/> aim and +<Ability:DGG_DEF_BONUS/> defense against targets at a lower elevation."
LocHelpText="Confers +<Ability:DGG_AIM_BONUS/> aim and +<Ability:DGG_DEF_BONUS/> defense against targets at a lower elevation."
LocPromotionPopupText="<Bullet/> Confers +<Ability:DGG_AIM_BONUS/> aim and +<Ability:DGG_DEF_BONUS/> defense against targets at a lower elevation.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[LW2WotC_Executioner X2AbilityTemplate]
LocFriendlyName="Executioner"
LocFlyOverText="Executioner"
LocLongDescription="Confers +<Ability:EXECUTIONER_AIM_BONUS/> aim and +<Ability:EXECUTIONER_CRIT_BONUS/> critical chance against targets at half or less of their original hit points."
LocHelpText="Confers +<Ability:EXECUTIONER_AIM_BONUS/> aim and +<Ability:EXECUTIONER_CRIT_BONUS/> critical chance against targets at half or less of their original hit points."
LocPromotionPopupText="<Bullet/> Confers +<Ability:EXECUTIONER_AIM_BONUS/> aim and +<Ability:EXECUTIONER_CRIT_BONUS/> critical chance against targets at half or less of their original hit points.<br/>"

[LW2WotC_Resilience X2AbilityTemplate]
LocFriendlyName="Resilience"
LocFlyOverText="Resilience"
LocLongDescription="Enemy attacks against you suffer a -<Ability:RESILIENCE_CRITDEF_BONUS/> penalty to critical hit chances."
LocHelpText="Enemy attacks against you suffer a -<Ability:RESILIENCE_CRITDEF_BONUS/> penalty to critical hit chances."
LocPromotionPopupText="<Bullet/> Enemy attacks against you suffer a -<Ability:RESILIENCE_CRITDEF_BONUS/> penalty to critical hit chances.<br/>"

[LW2WotC_TacticalSense X2AbilityTemplate]
LocFriendlyName="Tactical Sense"
LocFlyOverText="Tactical Sense"
LocLongDescription="Gain +<Ability:TACTICAL_SENSE_DEF_BONUS_PER_ENEMY/> defense for each enemy you can see, up to a maximum of +<Ability:TACTICAL_SENSE_MAX_DEF_BONUS/> defense."
LocHelpText="Gain +<Ability:TACTICAL_SENSE_DEF_BONUS_PER_ENEMY/> defense for each enemy you can see, up to a maximum of +<Ability:TACTICAL_SENSE_MAX_DEF_BONUS/> defense."
LocPromotionPopupText="<Bullet/> Gain +<Ability:TACTICAL_SENSE_DEF_BONUS_PER_ENEMY/> defense for each living enemy you can see, up to a maximum of +<Ability:TACTICAL_SENSE_MAX_DEF_BONUS/> defense.<br/><Bullet/> <Ability:TS_SQUADSIGHT_ENEMIES_APPLY/><br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[LW2WotC_Aggression X2AbilityTemplate]
LocFriendlyName="Aggression"
LocFlyOverText="Aggression"
LocLongDescription="Gain +<Ability:AGGRESSION_CRIT_BONUS_PER_ENEMY/> critical chance for each enemy you can see, up to a maximum of +<Ability:AGGRESSION_MAX_CRIT_BONUS/>."
LocHelpText="Gain +<Ability:AGGRESSION_CRIT_BONUS_PER_ENEMY/> critical chance for each enemy you can see, up to a maximum of +<Ability:AGGRESSION_MAX_CRIT_BONUS/>."
LocPromotionPopupText="<Bullet/> Gain +<Ability:AGGRESSION_CRIT_BONUS_PER_ENEMY/> critical chance for each enemy you can see, up to a maximum of +<Ability:AGGRESSION_MAX_CRIT_BONUS/>.<br/><Bullet/> <Ability:AGG_SQUADSIGHT_ENEMIES_APPLY/><br/>"

[LW2WotC_BringEmOn X2AbilityTemplate]
LocFriendlyName="Bring 'Em On"
LocFlyOverText="Bring 'Em On"
LocLongDescription="Gain +<Ability:BEO_BONUS_CRIT_DAMAGE_PER_ENEMY/> damage on critical hits for every two enemies you can see, up to a maximum of +<Ability:BEO_MAX_BONUS_CRIT_DAMAGE/>."
LocHelpText="Gain +<Ability:BEO_BONUS_CRIT_DAMAGE_PER_ENEMY/> damage on critical hits for every two enemies you can see, up to a maximum of +<Ability:BEO_MAX_BONUS_CRIT_DAMAGE/>."
LocPromotionPopupText="<Bullet/> Gain +<Ability:BEO_BONUS_CRIT_DAMAGE_PER_ENEMY/> damage on critical hits for every two enemies you can see, up to a maximum of +<Ability:BEO_MAX_BONUS_CRIT_DAMAGE/>.<br/><Bullet/> <Ability:BEO_SQUADSIGHT_ENEMIES_APPLY/><br/><Bullet/> Applies to damage from primary weapon only."

[LW2WotC_HardTarget X2AbilityTemplate]
LocFriendlyName="Hard Target"
LocFlyOverText="Hard Target"
LocLongDescription="Gain +<Ability:HT_DODGE_BONUS_PER_ENEMY/> dodge per enemy you can see, up to a maximum of +<Ability:HT_MAX_DODGE_BONUS/>."
LocHelpText="Gain +<Ability:HT_DODGE_BONUS_PER_ENEMY/> dodge per enemy you can see, up to a maximum of +<Ability:HT_MAX_DODGE_BONUS/>."
LocPromotionPopupText="<Bullet/> Gain +<Ability:HT_DODGE_BONUS_PER_ENEMY/> dodge per enemy you can see, up to a maximum of +<Ability:HT_MAX_DODGE_BONUS/>.<br/><Bullet/> <Ability:HT_SQUADSIGHT_ENEMIES_APPLY/><br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[LW2WotC_Infighter X2AbilityTemplate]
LocFriendlyName="Infighter"
LocFlyOverText="Infighter"
LocLongDescription="Gain +<Ability:INFIGHTER_DODGE_BONUS/> dodge against attacks within <Ability:INFIGHTER_MAX_TILES/> tiles."
LocHelpText="Gain +<Ability:INFIGHTER_DODGE_BONUS/> dodge against attacks within <Ability:INFIGHTER_MAX_TILES/> tiles."
LocPromotionPopupText="<Bullet/> Gain +<Ability:INFIGHTER_DODGE_BONUS/> dodge against attacks within <Ability:INFIGHTER_MAX_TILES/> tiles.<br/><Bullet/> Dodge bonus also applies to melee attacks.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[LW2WotC_DepthPerception X2AbilityTemplate]
LocFriendlyName="Depth Perception"
LocFlyOverText="Depth Perception"
LocLongDescription="Gain <Ability:DP_AIM_BONUS/> aim and reduce enemies' dodge by <Ability:DP_ANTIDODGE_BONUS/> when at a higher elevation than your target."
LocHelpText="Gain <Ability:DP_AIM_BONUS/> aim and reduce enemies' dodge by <Ability:DP_ANTIDODGE_BONUS/> when at a higher elevation than your target."
LocPromotionPopupText="<Bullet/> Gain <Ability:DP_AIM_BONUS/> aim and reduce enemies' dodge by <Ability:DP_ANTIDODGE_BONUS/> when at a higher elevation than your target.<br/>"

[LW2WotC_WilltoSurvive X2AbilityTemplate]
LocFriendlyName="Will to Survive"
LocFlyOverText="Will to Survive"
LocLongDescription="Enemy damage is reduced when in cover and attacked through that cover. High cover reduces damage by <Ability:W2S_HIGH_COVER_ARMOR_BONUS/>. Low cover reduces damage by <Ability:W2S_LOW_COVER_ARMOR_BONUS/>. Also grants <Ability:WILLTOSURVIVE_WILLBONUS/> will."
LocHelpText="Enemy damage is reduced when in cover and attacked through that cover. High cover reduces damage by <Ability:W2S_HIGH_COVER_ARMOR_BONUS/>. Low cover reduces damage by <Ability:W2S_LOW_COVER_ARMOR_BONUS/>. Also grants <Ability:WILLTOSURVIVE_WILLBONUS/> will."
LocPromotionPopupText="<Bullet/> Enemy damage is reduced when in cover and attacked through that cover. High cover reduces damage by <Ability:W2S_HIGH_COVER_ARMOR_BONUS/>. Low cover reduces damage by <Ability:W2S_LOW_COVER_ARMOR_BONUS/>.<br/><Bullet/> Cover against explosives and other indirect attacks is calculated from the point of the explosion.<br/><Bullet/> Armor piercing effects do not eliminate this bonus.<br/><Bullet/> This unit also permanently gains <Ability:WILLTOSURVIVE_WILLBONUS/> will.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[LW2WotC_LightEmUp X2AbilityTemplate]
LocFriendlyName="Light 'Em Up"
LocFlyOverText="Light 'Em Up"
LocLongDescription="Taking a standard shot with your primary weapon as your first action no longer ends your turn."
LocHelpText="Taking a standard shot with your primary weapon as your first action no longer ends your turn."
LocPromotionPopupText="<Bullet/> Taking a standard shot with your primary weapon as your first action no longer ends your turn.<br/>"

[LW2WotC_CloseEncounters X2AbilityTemplate]
LocFriendlyName="Close Encounters"
LocFlyOverText="Close Encounters"
LocLongDescription="Gain a bonus action after taking a standard shot with your primary weapon at an enemy within <Ability:CE_MAX_TILES/>. <Ability:CE_USES_PER_TURN/>"
LocHelpText="Gain a bonus action after taking a standard shot with your primary weapon at an enemy within <Ability:CE_MAX_TILES/>. <Ability:CE_USES_PER_TURN/>"
LocPromotionPopupText="<Bullet/> Gain a bonus action after taking a standard shot with your primary weapon at an enemy within <Ability:CE_MAX_TILES/>.<br/><Bullet/> <Ability:CE_USES_PER_TURN/><br/><Bullet/> A red ring will mark the range of this ability.<br/><Bullet/> Close Encounters cannot be used on the same turn as Run and Gun.<br/>"

[LW2WotC_LoneWolf X2AbilityTemplate]
LocFriendlyName="Lone Wolf"
LocFlyOverText="Lone Wolf"
LocLongDescription="Gain +<Ability:LONEWOLF_AIM_BONUS/> aim, +<Ability:LONEWOLF_CRIT_BONUS/> critical chance, and +<Ability:LONEWOLF_DEF_BONUS/> defense when <Ability:LONEWOLF_MIN_DIST_TILES/> or more tiles distant from any ally."
LocHelpText="Gain +<Ability:LONEWOLF_AIM_BONUS/> aim, +<Ability:LONEWOLF_CRIT_BONUS/> critical chance, and +<Ability:LONEWOLF_DEF_BONUS/> defense when <Ability:LONEWOLF_MIN_DIST_TILES/> or more tiles distant from any ally."
LocPromotionPopupText="<Bullet/> Gain +<Ability:LONEWOLF_AIM_BONUS/> aim, +<Ability:LONEWOLF_CRIT_BONUS/> critical chance, and +<Ability:LONEWOLF_DEF_BONUS/> defense when <Ability:LONEWOLF_MIN_DIST_TILES/> or more tiles distant from any ally.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[LW2WotC_LowProfile X2AbilityTemplate]
LocFriendlyName="Low Profile"
LocFlyOverText="Low Profile"
LocLongDescription="Makes partial cover count as full."
LocHelpText="Makes partial cover count as full."
LocPromotionPopupText="<Bullet/> Makes partial cover count as full.<br/>"

[LW2WotC_HyperReactivePupils X2AbilityTemplate]
LocFriendlyName="Hyper-Reactive Pupils"
LocFlyOverText="Hyper-Reactive Pupils"
LocLongDescription="Gain +<Ability:HYPERREACTIVE_PUPILS_AIM_BONUS/> aim for your next shot with your primary weapon after a miss."
LocHelpText="Gain +<Ability:HYPERREACTIVE_PUPILS_AIM_BONUS/> aim for your next shot with your primary weapon after a miss."
LocPromotionPopupText="<Bullet/> Bonus applies until the next time you hit a target or the mission ends.<br/><Bullet/> Area-of-Effect-based shots do not induce the bonus.<br/>"

[LW2WotC_LockedOn X2AbilityTemplate]
LocFriendlyName="Locked On"
LocFlyOverText="Locked On"
LocLongDescription="Gain +<Ability:LOCKEDON_AIM_BONUS/> aim and +<Ability:LOCKEDON_CRIT_BONUS/> crit for successive shots with your primary weapon at the same enemy unit."
LocHelpText="Gain +<Ability:LOCKEDON_AIM_BONUS/> and +<Ability:LOCKEDON_CRIT_BONUS/> aim for successive shots with your primary weapon at the same enemy unit."
LocPromotionPopupText="<Bullet/> Gain +<Ability:LOCKEDON_AIM_BONUS/> aim and +<Ability:LOCKEDON_CRIT_BONUS/> crit for repeated shots with your primary weapon at the same target. Not cumulative, and only applies to enemy units.<br/><Bullet/> Area-of-Effect-based shots do not grant the bonus."

[LW2WotC_Sentinel X2AbilityTemplate]
LocFriendlyName="Sentinel"
LocFlyOverText="Sentinel"
LocLongDescription="When in overwatch, you may take <Ability:SENTINEL_LW_USES_PER_TURN/> reaction shots."
LocHelpText="When in overwatch, you may take <Ability:SENTINEL_LW_USES_PER_TURN/> reaction shots."
LocPromotionPopupText="<Bullet/> Reaction shots may be at one or multiple targets, depending on alien movement.<br/>"

[LW2WotC_RapidReaction X2AbilityTemplate]
LocFriendlyName="Rapid Reaction"
LocFlyOverText="Rapid Reaction"
LocLongDescription="When in overwatch, each shot you hit with grants another reaction fire shot, up to a maximum of <Ability:RAPID_REACTION_USES_PER_TURN/> shots."
LocHelpText="When in overwatch, each shot you hit with grants another shot, up to a maximum of <Ability:RAPID_REACTION_USES_PER_TURN/> shots."
LocPromotionPopupText="<Bullet/> When in overwatch, each shot you hit with grants another reaction fire shot, up to a maximum of <Ability:RAPID_REACTION_USES_PER_TURN/> shots.<br/>"

[LW2WotC_TraverseFire X2AbilityTemplate]
LocFriendlyName="Traverse Fire"
LocFlyOverText="Traverse Fire"
LocLongDescription="After taking a standard shot with your primary weapon with your first action, you may take an additional non-movement action."
LocHelpText="After taking a standard shot with your primary weapon with your first action, you may take an additional non-movement action."
LocPromotionPopupText="<Bullet/> After taking a standard shot with your primary weapon with your first action, you may take an additional non-movement action.<br/>"

[LW2WotC_Cutthroat X2AbilityTemplate]
LocFriendlyName="Cutthroat"
LocFlyOverText="Cutthroat"
LocLongDescription="Your melee attacks against biological enemies ignore their armor, have a +<Ability:CUTTHROAT_BONUS_CRIT_CHANCE/> critical chance, and do +<Ability:CUTTHROAT_BONUS_CRIT_DAMAGE/> critical damage."
LocHelpText="Your melee attacks against biological enemies ignore their armor, have a +<Ability:CUTTHROAT_BONUS_CRIT_CHANCE/> critical chance, and do +<Ability:CUTTHROAT_BONUS_CRIT_DAMAGE/> critical damage."
LocPromotionPopupText="<Bullet/> Your melee attacks against biological enemies ignore their armor, have a +<Ability:CUTTHROAT_BONUS_CRIT_CHANCE/> critical chance, and do +<Ability:CUTTHROAT_BONUS_CRIT_DAMAGE/> critical damage."

[LW2WotC_WalkFire X2AbilityTemplate]
LocFriendlyName="Walk Fire"
LocFlyOverText="Walk Fire"
LocLongDescription="Take a highly accurate shot with +<Ability:WALK_FIRE_AIM_BONUS> bonus to hit but for <Ability:WALK_FIRE_DAMAGE_PERCENT_MALUS>% damage and -<Ability:WALK_FIRE_CRIT_MALUS> crit. Uses <Ability:WALK_FIRE_AMMO_COST> ammo. <Ability:WALK_FIRE_COOLDOWN> turn cooldown."
LocHelpText="Special shot: +<Ability:WALK_FIRE_AIM_BONUS> aim, -<Ability:WALK_FIRE_CRIT_MALUS> crit, <Ability:WALK_FIRE_DAMAGE_PERCENT_MALUS>% damage, uses <Ability:SelfAmmoCost/> ammo."
LocPromotionPopupText="<Bullet/> This is a special shot in which the soldier adjusts their aim in the middle of an automatic weapon burst, conferring +<Ability:WALK_FIRE_AIM_BONUS> aim and -<Ability:WALK_FIRE_CRIT_MALUS> crit and doing <Ability:WALK_FIRE_DAMAGE_PERCENT_MALUS>% damage.<br/><Bullet/> Consumes <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> <Ability:WALK_FIRE_COOLDOWN> turn cooldown.<br/><Bullet/> Requires a burst-fire weapon; ability will not be available when a shotgun or sniper rifle is equipped as a primary weapon."

[LW2WotC_PrecisionShot X2AbilityTemplate]
LocFriendlyName="Precision Shot"
LocFlyOverText="Precision Shot"
LocLongDescription="Take a special shot with +<Ability:PRECISION_SHOT_CRIT_BONUS> bonus to critical chance and <Ability:PRECISION_SHOT_CRIT_DAMAGE_PERCENT_BONUS>% bonus critical damage. <Ability:PRECISION_SHOT_COOLDOWN> turn cooldown. Uses <Ability:PRECISION_SHOT_AMMO_COST> ammo."
LocHelpText="Take a special shot with +<Ability:PRECISION_SHOT_CRIT_BONUS> bonus to critical chance and <Ability:PRECISION_SHOT_CRIT_DAMAGE_PERCENT_BONUS>% bonus critical damage. <Ability:PRECISION_SHOT_COOLDOWN> turn cooldown. Uses <Ability:PRECISION_SHOT_AMMO_COST> ammo."
LocPromotionPopupText="<Bullet/> Take a special shot with +<Ability:PRECISION_SHOT_CRIT_BONUS> bonus to critical chance and <Ability:PRECISION_SHOT_CRIT_DAMAGE_PERCENT_BONUS>% bonus critical damage. <Ability:PRECISION_SHOT_COOLDOWN> turn cooldown. Uses <Ability:PRECISION_SHOT_AMMO_COST> ammo.<br/>"

[LW2WotC_PrecisionShot_Bonuses X2AbilityTemplate]
LocFriendlyName="Precision Shot"
LocFlyOverText="Precision Shot"
LocLongDescription="Take a special shot with +<Ability:PRECISION_SHOT_CRIT_BONUS> bonus to critical chance and <Ability:PRECISION_SHOT_CRIT_DAMAGE_PERCENT_BONUS>% bonus critical damage. <Ability:PRECISION_SHOT_COOLDOWN> turn cooldown. Uses <Ability:PRECISION_SHOT_AMMO_COST> ammo."
LocHelpText="Take a special shot with +<Ability:PRECISION_SHOT_CRIT_BONUS> bonus to critical chance and <Ability:PRECISION_SHOT_CRIT_DAMAGE_PERCENT_BONUS>% bonus critical damage. <Ability:PRECISION_SHOT_COOLDOWN> turn cooldown. Uses <Ability:PRECISION_SHOT_AMMO_COST> ammo."
LocPromotionPopupText="<Bullet/> Take a special shot with +<Ability:PRECISION_SHOT_CRIT_BONUS> bonus to critical chance and <Ability:PRECISION_SHOT_CRIT_DAMAGE_PERCENT_BONUS>% bonus critical damage. <Ability:PRECISION_SHOT_COOLDOWN> turn cooldown. Uses <Ability:PRECISION_SHOT_AMMO_COST> ammo.<br/>"

[LW2WotC_Covert X2AbilityTemplate]
LocFriendlyName="Covert"
LocFlyOverText="Covert"
LocLongDescription="Enemies have <Ability:COVERT_DETECTION_RANGE_REDUCTION>% smaller detection range against you."
LocHelpText="Enemies have reduced detection range against you."
LocPromotionPopupText="<Bullet/> Enemies have <Ability:COVERT_DETECTION_RANGE_REDUCTION>% smaller detection range against you, as denoted by red tiles surrounding enemies who are not alerted to your presence.<br/><Bullet/> Does not apply to ADVENT security towers."

[LW2WotC_SlugShot X2AbilityTemplate]
LocFriendlyName="Slug Shot"
LocFlyOverText="Slug Shot"
LocLongDescription="Special shot for primary-weapon shotguns only: Fire a shot that pierces <Ability:SLUG_SHOT_PIERCE> armor and has no range penalties. Uses <Ability:SelfAmmoCost/> ammo. <Ability:SLUG_SHOT_COOLDOWN/> turn cooldown."
LocHelpText="Armor-piercing special shotgun shot with no range penalties."
LocPromotionPopupText="<Bullet/> Special shot for primary-weapon shotguns only: Fire a shot with no range penalties.<br/><Bullet/> The shot will pierce <Ability:SLUG_SHOT_PIERCE> armor points.<br/><Bullet/> <Ability:SLUG_SHOT_COOLDOWN/> turn cooldown.<br/><Bullet/> Requires <Ability:SelfAmmoCost/> ammo.<br/>"

[LW2WotC_SlugShot_Bonuses X2AbilityTemplate]
LocFriendlyName="Slug Shot"
LocFlyOverText="Slug Shot"
LocLongDescription="Special shot for primary-weapon shotguns only: Fire a shot that pierces <Ability:SLUG_SHOT_PIERCE> armor and has no range penalties. Uses <Ability:SelfAmmoCost/> ammo. <Ability:SLUG_SHOT_COOLDOWN/> turn cooldown."
LocHelpText="Armor-piercing special shotgun shot with no range penalties."
LocPromotionPopupText="<Bullet/> Special shot for primary-weapon shotguns only: Fire a shot with no range penalties.<br/><Bullet/> The shot will pierce <Ability:SLUG_SHOT_PIERCE> armor points.<br/><Bullet/> <Ability:SLUG_SHOT_COOLDOWN/> turn cooldown.<br/><Bullet/> Requires <Ability:SelfAmmoCost/> ammo.<br/>"

[LW2WotC_DamageControl X2AbilityTemplate]
LocFriendlyName="Damage Control"
LocFlyOverText="Damage Control"
LocLongDescription="After taking damage, gain <Ability:DAMAGE_CONTROL_BONUS_ARMOR> armor through the end of the turn."
LocHelpText="After taking damage, gain <Ability:DAMAGE_CONTROL_BONUS_ARMOR> armor through the end of the turn."
LocPromotionPopupText="<Bullet/> Your armor hardens temporarily after an impact. After taking damage, gain <Ability:DAMAGE_CONTROL_BONUS_ARMOR> armor through the end of the next turn.

[LW2WotC_RapidDeployment X2AbilityTemplate]
LocFriendlyName="Rapid Deployment"
LocFlyOverText="Rapid Deployment"
LocLongDescription="Activate this ability before throwing or launching a support grenade, and the throw will not cost an action. <Ability:RAPID_DEPLOYMENT_COOLDOWN> turn cooldown."
LocHelpText="Activate this ability before throwing or launching a support grenade, and the throw will not cost an action. <Ability:RAPID_DEPLOYMENT_COOLDOWN> turn cooldown."
LocPromotionPopupText="<Bullet/> Activate this ability before throwing or launching a support grenade, and the throw will not cost an action.<br/><Bullet/> Applies to Smoke Grenades, Flashbangs and Battle Scanners.<br/><Bullet/> <Ability:RAPID_DEPLOYMENT_COOLDOWN> turn cooldown.<br/>"

[LW2WotC_Fleche X2AbilityTemplate]
LocFriendlyName="Fleche"
LocFlyOverText="Fleche"
LocLongDescription="Attack any enemy within movement range with your sword. Deals +1 damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between your starting position and the target."
LocHelpText="Attack any enemy within movement range with your sword. Deals bonus damage for attacks from a distance."
LocPromotionPopupText="<Bullet/> You can trigger the Fleche ability by placing the movement cursor over an enemy.<br/><Bullet/> A soldier can perform a \"Dash\" move, using both actions to move, and still trigger an attack against an adjacent enemy.<br/><Bullet/>  Fleche deals 1 bonus damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between unit's position at the start of its turn and the target's position.<br/>"

[LW2WotC_Fleche_Bonuses X2AbilityTemplate]
LocFriendlyName="Fleche"
LocFlyOverText="Fleche"
LocLongDescription="Attack any enemy within movement range with your sword. Deals +1 damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between your starting position and the target."
LocHelpText="Attack any enemy within movement range with your sword. Deals bonus damage for attacks from a distance."
LocPromotionPopupText="<Bullet/> You can trigger the Fleche ability by placing the movement cursor over an enemy.<br/><Bullet/> A soldier can perform a \"Dash\" move, using both actions to move, and still trigger an attack against an adjacent enemy.<br/><Bullet/>  Fleche deals 1 bonus damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between unit's position at the start of its turn and the target's position.<br/>"

[LW2WotC_Slash X2AbilityTemplate]
LocFriendlyName="Slash"
LocFlyOverText="Slash"
LocLongDescription="Attack an adjacent target with your sword. Uses one action."
LocHelpText="Attack an adjacent target with your sword. Uses one action."
LocPromotionPopupText="<Bullet/> Attack an adjacent target with your sword.<br/><Bullet/> Uses one action and doesn't automatically end your turn, so two attacks a turn are possible."

[LW2WotC_TrenchGun X2AbilityTemplate]
LocFriendlyName="Trench Gun"
LocFlyOverText="Trench Gun"
LocLongDescription="Special shot for primary-weapon shotguns only: Fire a short-range cone-based attack at nearby targets. <Ability:TRENCH_GUN_COOLDOWN> turn cooldown."
LocHelpText="Special shot for primary-weapon shotguns only: Fire a short-range cone-based attack at nearby targets. <Ability:TRENCH_GUN_COOLDOWN> turn cooldown."
LocPromotionPopupText="<Bullet/> Special shot for primary-weapon shotguns only: Fire a short-range cone-based attack at nearby targets.<br/><Bullet/> <Ability:TRENCH_GUN_COOLDOWN> cooldown, uses <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Ability will not be available with other primary weapons.<br/><Bullet/> The shot will not penetrate heavy cover, so this ability is best used in flanking situations.<br/><Bullet/> Allies in the area of effect can take damage.<br/>

[LW2WotC_Fortify X2AbilityTemplate]
LocFriendlyName="Fortify"
LocLongDescription="Activate to grant +<ABILITY:FORTIFY_DEFENSE/> defense until the beginning of the next turn. Does not cost an action. Has a <ABILITY:FORTIFY_COOLDOWN/> turn cooldown."
LocHelpText="Activate to grant +<ABILITY:FORTIFY_DEFENSE/> defense. Free action. <ABILITY:FORTIFY_COOLDOWN/> turn cooldown."
LocFlyOverText="Fortified"
LocPromotionPopUpText="<Bullet/> Activate to grant the soldier +<ABILITY:FORTIFY_DEFENSE/> defense until the beginning of the soldier's next turn.<br/><Bullet/> Does not cost an action. Has a <ABILITY:FORTIFY_COOLDOWN/> turn cooldown."

[LW2WotC_Formidable X2AbilityTemplate]
LocFriendlyName="Formidable"
LocFlyOverText="Formidable"
LocLongDescription="Your gear includes an extra layer of protection, granting <Ability:FORMIDABLE_ABLATIVE_HP/> bonus ablative hit points and <Ability:BlastPadding/>% less damage from explosive attacks."
LocHelpText="Gain bonus hit points and reduce explosive damage taken."
LocPromotionPopupText="<Bullet/> Formidable reduces explosive damage taken by <Ability:BlastPadding/>%.

[LW2WotC_StreetSweeper X2AbilityTemplate]
LocFriendlyName="Street Sweeper"
LocFlyOverText="Street Sweeper"
LocLongDescription="Cone-based shotgun attack that does bonus damage to unarmored targets. Blocked by heavy cover."
LocHelpText="Cone-based shotgun attack that does bonus damage to unarmored targets. Blocked by heavy cover."
LocPromotionPopupText="<Bullet/> Medium-range, cone-based shotgun attack.<br/><Bullet/> The spread pattern is blocked by heavy cover.<br/><Bullet/> Uses one action and <Ability:SelfAmmoCost/> ammo, and has <Ability:STREET_SWEEPER_COOLDOWN> turn cooldown.<br/><Bullet/> Does <Ability:STREET_SWEEPER_UNARMORED_DAMAGE_BONUS> bonus damage against unarmored targets within the spread pattern.<br/><Bullet/> Cannot be used with non-shotgun weapons.<br/><Bullet/> Allies can be injured by this attack.<br/>"

[LW2WotC_LightningReflexes X2AbilityTemplate]
LocFriendlyName="Lightning Reflexes"
LocFlyOverText="Lightning Reflexes"
LocLongDescription="Reaction fire shots against you have a significantly decreased chance to hit. The bonus goes down with each additional reaction shot you face."
LocHelpText="Reaction fire shots against you have a decreased chance to hit."
LocPromotionPopupText="<Bullet/> Reaction fire shots against you have a significantly decreased chance to hit.<br/><Bullet/> The first reaction shot against you during a turn is at -100 to hit; the second at -80; the third at -60; the fourth at -40, and the fifth at -20. Further reaction shots at are normal to hit chances.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[LW2WotC_RunAndGun X2AbilityTemplate]
LocFriendlyName="Run And Gun"
LocFlyOverText="Run And Gun"
LocLongDescription="Take an action after dashing."
LocHelpText="Take an action after dashing."
LocPromotionPopupText="<Bullet/> Run and Gun allows soldiers to close the distance to their targets rapidly, or to easily take a flanking position.<br/><Bullet/> Run and Gun has a <Ability:RUN_AND_GUN_COOLDOWN> turn cooldown.<br/>"

[LW2WotC_KillerInstinct X2AbilityTemplate]
LocFriendlyName="Killer Instinct"
LocFlyOverText="Killer Instinct"
LocLongDescription="Activating Run & Gun grants +<Ability:KILLER_INSTINCT_CRIT_DAMAGE_BONUS_PCT>% critical damage for the rest of the turn."
LocHelpText="Activating Run & Gun grants +<Ability:KILLER_INSTINCT_CRIT_DAMAGE_BONUS_PCT>% critical damage for the rest of the turn."
LocPromotionPopupText="<Bullet/> Activating Run & Gun grants +<Ability:KILLER_INSTINCT_CRIT_DAMAGE_BONUS_PCT>% critical damage for the rest of the turn.<br/>"

[LW2WotC_ExtraConditioning X2AbilityTemplate]
LocFriendlyName="Extra Conditioning"
LocFlyOverText="Extra Conditioning"
LocLongDescription="Run and Gun cooldown is reduced by <Ability:EXTRA_CONDITIONING_COOLDOWN_REDUCTION> turn."
LocHelpText="Run and Gun cooldown is reduced by <Ability:EXTRA_CONDITIONING_COOLDOWN_REDUCTION> turn."
LocPromotionPopupText="<Bullet/> Run and Gun cooldown is reduced by <Ability:EXTRA_CONDITIONING_COOLDOWN_REDUCTION> turn.<br/>"

[LW2WotC_Smoker X2AbilityTemplate]
LocFriendlyName="Smoker"
LocFlyOverText="Smoker"
LocLongDescription="Grants one free smoke grenade item to your inventory."
LocHelpText="Grants one free smoke grenade item to your inventory."
LocPromotionPopupText="<Bullet/> Grants one free smoke grenade item to your inventory.<br/>"

[LW2WotC_DenseSmoke X2AbilityTemplate]
LocFriendlyName="Dense Smoke"
LocFlyOverText="Dense Smoke"
LocLongDescription="Your smoke grenades confer an additional <Ability:DENSE_SMOKE_INVERSE/> defense."
LocHelpText="Your smoke grenades confer an additional <Ability:DENSE_SMOKE_INVERSE/> defense."
LocPromotionPopupText="<Bullet/> Your smoke grenades confer an additional <Ability:DENSE_SMOKE_INVERSE/> defense to those within the smoke, for a total of <Ability:DENSE_SMOKE_TOTAL/>.<br/>"

[LW2WotC_GrazingFire X2AbilityTemplate]
LocFriendlyName="Grazing Fire"
LocFlyOverText="Grazing Fire"
LocLongDescription="Missed shots with your primary weapon have an additional roll to become a graze."
LocHelpText="Misses may become grazes."
LocPromotionPopupText="<Bullet/> Missed shots with the soldier's primary weapon generally have a <Ability:GRAZING_FIRE_SUCCESS_CHANCE>% chance to become a graze.<br/><Bullet/> This effect occurs after normal hit-miss-graze processing.<br/><Bullet/> Targets with a dodge score subtract that score from the ability's success chance."

[LW2WotC_CombatFitness X2AbilityTemplate]
LocFriendlyName="Combat Fitness"
LocLongDescription="Gain <ABILITY:COMBAT_FITNESS_OFFENSE/> aim, <ABILITY:COMBAT_FITNESS_MOBILITY/> mobility, <ABILITY:COMBAT_FITNESS_HP/> HP, <ABILITY:COMBAT_FITNESS_WILL/> will, and <ABILITY:COMBAT_FITNESS_DODGE/> dodge."
LocHelpText="This soldier has numerous stat bonuses."
LocPromotionPopupText="<Bullet/> Combat Fitness provides <ABILITY:COMBAT_FITNESS_OFFENSE/> aim, <ABILITY:COMBAT_FITNESS_MOBILITY/> mobility, <ABILITY:COMBAT_FITNESS_HP/> HP, <ABILITY:COMBAT_FITNESS_WILL/> will, and <ABILITY:COMBAT_FITNESS_DODGE/> dodge."

[LW2WotC_Sprinter X2AbilityTemplate]
LocFriendlyName="Sprinter"
LocLongDescription="Gain <ABILITY:SPRINTER_MOBILITY/> mobility."
LocHelpText="This soldier has bonus mobility."
LocPromotionPopupText="<Bullet/> Sprinter provides <ABILITY:SPRINTER_MOBILITY/> bonus mobility."

[LW2WotC_AlphaMikeFoxtrot X2AbilityTemplate]
LocFriendlyName="Alpha Mike Foxtrot"
LocFlyOverText="Alpha Mike Foxtrot"
LocLongDescription="You do <Ability:ALPHAMIKEFOXTROT_DAMAGE/> additional points of base damage with your primary weapon."
LocHelpText="You do <Ability:ALPHAMIKEFOXTROT_DAMAGE/> additional points of base damage with your primary weapon."
LocPromotionPopupText="<Bullet/> You do <Ability:ALPHAMIKEFOXTROT_DAMAGE/> additional points of base damage with your primary weapon."

[LW2WotC_CoupDeGrace X2AbilityTemplate]
LocFriendlyName="Coup de Grâce"
LocFlyOverText="Coup de Grâce"
LocLongDescription="Bonus to hit, damage, and critical chance with a melee weapon against a disoriented, stunned or panicking enemy."
LocHelpText="Bonus to hit, damage, and critical chance with a melee weapon against a disoriented, stunned, or panicking  enemy."
LocPromotionPopupText="<Bullet/> Coup de Grâce grants +<Ability:COUP_DE_GRACE_HIT_BONUS/> aim, +<Ability:COUP_DE_GRACE_CRIT_BONUS/> critical chance and +<Ability:COUP_DE_GRACE_DAMAGE_BONUS/> damage against stunned and panicking enemies.<br/><Bullet/> The bonuses are halved against disoriented enemies."

[LW2WotC_Interference X2AbilityTemplate]
LocFriendlyName="Interference"
LocFlyOverText="Interference"
LocLongDescription="GREMLIN cancels overwatch on targeted unit. Use <Ability:INTERFERENCE_CV_CHARGES> times per battle."
LocHelpText="Cancels overwatch on targeted unit."
LocPromotionPopupText="<Bullet/> Cancels overwatch on targeted unit.<br/><Bullet/> Uses <Ability:INTERFERENCE_ACTION_POINTS> action.<br/><Bullet/> <Ability:INTERFERENCE_CV_CHARGES> charges per battle, improves with better Gremlin tech.<br/>"

[LW2WotC_RescueProtocol X2AbilityTemplate]
LocFriendlyName="Rescue Protocol"
LocFlyoverText="Rescue Protocol"
LocLongDescription="Use your Gremlin to grant a movement action to an ally."
LocHelpText="Grant a movement action to an ally."
LocPromotionPopupText="<Bullet/> Rescue Protocol can only be used on allies with no action points left.<br/><Bullet/> It cannot be used on concealed, suppressing or overwatching units.<br/><Bullet/> An ally cannot benefit from both Command and Rescue Protocol in the same turn.<br/><Bullet/> Uses one action.<br/><Bullet/> Charges increase with improved Gremlin technology.<br/>

[LW2WotC_BoostedCores X2AbilityTemplate]
LocFriendlyName="Boosted Cores"
LocFlyOverText="Boosted Cores"
LocLongDescription="Explosive grenades do <Ability:BOOSTED_CORES_DAMAGE> additional damage."
LocHelpText="Explosive grenades do <Ability:BOOSTED_CORES_DAMAGE> additional damage."
LocPromotionPopupText="<Bullet/> Your grenades have extra explosives and do <Ability:BOOSTED_CORES_DAMAGE> additional damage but require special training to handle.<br/><Bullet/> This also applies to grenade effects, like fire from incendiary weapons.<br/>"

[LW2WotC_VolatileMix X2AbilityTemplate]
LocFriendlyName="Volatile Mix"
LocLongDescription="Your grenades' area of effect is increased by one tile."
LocHelpText="Your grenades cover a greater area of effect."
LocFlyOverText="Volatile Mix"
LocPromotionPopupText="<Bullet/> Your grenades do regular and environmental damage in the expanded area of effect, and apply any additional effects there as well.

[LW2WotC_Airdrop X2AbilityTemplate]
LocFriendlyName="Airdrop"
LocFlyOverText="Airdrop"
LocLongDescription="The Gremlin grants an explosive grenade to the targeted ally. <Ability:NUM_AIRDROP_CHARGES> uses per mission."
LocHelpText="Grants an explosive grenade to the targeted ally."
LocPromotionPopupText="<Bullet/> Grants an explosive grenade to the targeted ally.<br/><Bullet/> Airdrop initially confers a frag grenade, but as XCOM's technology improves it will instead provide a more advanced device.<br/><Bullet/> Activating Airdrop uses one action and does not end the soldier's turn.<br/><Bullet/> <Ability:NUM_AIRDROP_CHARGES> uses per mission."

[LW2WotC_Flashbanger X2AbilityTemplate]
LocFriendlyName="Flashbanger"
LocFlyOverText="Flashbanger"
LocLongDescription="Grants one free flashbang item to your inventory."
LocHelpText="Grants one free flashbang item to your inventory."
LocPromotionPopupText="<Bullet/> Grants one free flashbang item to your inventory.<br/>"

[LW2WotC_CyclicFire X2AbilityTemplate]
LocFriendlyName="Cyclic Fire"
LocFlyOverText="Cyclic Fire"
LocLongDescription="Special Shot: Fire <Ability:CYCLIC_FIRE_SHOTS> shots at a target in a single attack. Requires <Ability:CYCLIC_FIRE_MIN_ACTION_REQ> actions and all shots have aim penalties. <Ability:CYCLIC_FIRE_COOLDOWN> turn cooldown."
LocHelpText="Special Shot: Fire <Ability:CYCLIC_FIRE_SHOTS> shots at a target in a single attack. Requires <Ability:CYCLIC_FIRE_MIN_ACTION_REQ> actions and all shots have aim penalties. <Ability:CYCLIC_FIRE_COOLDOWN> turn cooldown."
LocPromotionPopupText="<Bullet/> Special Shot: Fire <Ability:CYCLIC_FIRE_SHOTS> shots at a target in a single attack. Requires <Ability:CYCLIC_FIRE_MIN_ACTION_REQ> actions and all shots have a -<Ability:CYCLIC_FIRE_AIM_MALUS> penalty to aim.<br/><Bullet/> Requires <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Requires a burst-fire weapon; ability will not be available when a shotgun or sniper rifle is equipped as a primary weapon."

[LW2WotC_Kubikuri X2AbilityTemplate]
LocFriendlyName="Kubikuri"
LocFlyOverText="Kubikuri"
LocLongDescription="Special shot against most enemies who have taken any damage: Any critical hit kills them, but regular hits do half damage. Requires <Ability:KUBIKURI_MIN_ACTION_REQ> actions and has a <Ability:KUBIKURI_COOLDOWN> turn cooldown."
LocHelpText="Crits automatically kill enemies at less than full hit points. Regular hits do half damage."
LocPromotionPopupText="<Bullet/> Special shot against enemies with less than full hit points: Any critical hit kills them, but regular hits do half damage.<br/><Bullet/> Requires <Ability:KUBIKURI_MIN_ACTION_REQ> actions.<br/><Bullet/> <Ability:KUBIKURI_COOLDOWN> turn cooldown.<br/><Bullet/> Against alien rulers, a critical hit will do double normal crit damage instead of killing the enemy outright."

[LW2WotC_Evasive X2AbilityTemplate]
LocFriendlyName="Evasive"
LocFlyOverText="Evasive: +100 Dodge"
LocLongDescription="Start each mission with 100 bonus dodge. The bonus is removed after you take damage for the first time."
LocHelpText="Gain 100 dodge until you take damage."
LocPromotionPopupText="<Bullet/> This ability will typically turn the first hit on a soldier into a graze, but being hit with undodgeable attacks will remove it without any bonus being applied."

[LW2WotC_Evasive_Remover X2AbilityTemplate]
LocFriendlyName="Evasive bonus lost"
LocFlyOverText="Evasive bonus lost"
LocLongDescription="Start each mission with 100 bonus dodge. The bonus is removed after you take damage for the first time."
LocHelpText="Gain 100 dodge until you take damage."
LocPromotionPopupText="<Bullet/> This ability will typically turn the first hit on a soldier into a graze, but being hit with undodgeable attacks will remove it without any bonus being applied."

[LW2WotC_IronSkin X2AbilityTemplate]
LocFriendlyName="Iron Skin"
LocFlyOverText="Iron Skin"
LocLongDescription="Incoming melee damage is reduced by <Ability:IRON_SKIN_MELEE_DAMAGE_REDUCTION>."
LocHelpText="Incoming melee damage is reduced by <Ability:IRON_SKIN_MELEE_DAMAGE_REDUCTION>."
LocPromotionPopupText="<Bullet/> Incoming melee damage is reduced by <Ability:IRON_SKIN_MELEE_DAMAGE_REDUCTION>.<br/>"

[LW2WotC_CombatAwareness X2AbilityTemplate]
LocFriendlyName="Combat Awareness"
LocFlyOverText="Combat Awareness"
LocLongDescription="Grants <Ability:COMBAT_AWARENESS_BONUS_DEFENSE> defense and <Ability:COMBAT_AWARENESS_BONUS_ARMOR> armor point when in overwatch."
LocHelpText="Grants <Ability:COMBAT_AWARENESS_BONUS_DEFENSE> defense and <Ability:COMBAT_AWARENESS_BONUS_ARMOR> armor point when in overwatch."
LocPromotionPopupText="<Bullet/> Gain <Ability:COMBAT_AWARENESS_BONUS_DEFENSE> defense and <Ability:COMBAT_AWARENESS_BONUS_ARMOR> armor point when in overwatch.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired.<br/><Bullet/> Also applies while suppressing and while Killzone is active."

[LW2WotC_CombatRush X2AbilityTemplate]
LocFriendlyName="Combat Rush"
LocFlyOverText="Combat Rush"
LocLongDescription="When you kill an enemy, nearby allies temporarily receive bonuses to aim, critical chance and mobility. <Ability:COMBAT_RUSH_COOLDOWN> turn cooldown."
LocHelpText="When you kill an enemy, nearby allies receive temporary bonus to aim, crit chance and mobility."
LocPromotionPopupText="<Bullet/> Combat Rush triggers when you kill an enemy unit and provides allies within seven tiles +<Ability:COMBAT_RUSH_AIM_BONUS> aim, +<Ability:COMBAT_RUSH_CRIT_BONUS> critical chance and +<Ability:COMBAT_RUSH_MOBILITY_BONUS> mobility.<br/><Bullet/> The effect lasts until the end of the following turn after the kill.<br/><Bullet/> It can only trigger every <Ability:COMBAT_RUSH_COOLDOWN> turns.<br/>"

[LW2WotC_FullKit X2AbilityTemplate]
LocFriendlyName="Full Kit"
LocFlyOverText="Full Kit"
LocLongDescription="Grants +<Ability:FULL_KIT_BONUS> charge per grenade item in a utility slot."
LocHelpText="Grants +<Ability:FULL_KIT_BONUS> charge per grenade item in a utility slot."
LocPromotionPopupText="<Bullet/> Grants +<Ability:FULL_KIT_BONUS> charge per grenade item in a utility slot.<br/><Bullet/> Applies to explosive and support grenades as well as Battle Scanners.<br/>"

[LW2WotC_Ghostwalker X2AbilityTemplate]
LocFriendlyName="Ghostwalker"
LocFlyOverText="Ghostwalker"
LocLongDescription="Activate this ability to reduce enemy detection range against you by almost 25% for the rest of your turn as well as the following turn. <Ability:GHOSTWALKER_COOLDOWN> turn cooldown."
LocHelpText="Reduce enemy detection range by 25% for <Ability:GHOSTWALKER_DURATION> turns."
LocPromotionPopupText="<Bullet/> Activate this ability to reduce enemy detection range against you by almost 25% for <Ability:GHOSTWALKER_DURATION> turns (including the current turn), as denoted by red tiles surrounding enemies who are not alerted to your presence.<br/><Bullet/> <Ability:GHOSTWALKER_COOLDOWN> turn cooldown.<br/><Bullet/> Requires no actions to activate.<br/><Bullet/> Does not apply to ADVENT security towers."

[LW2WotC_Savior X2AbilityTemplate]
LocFriendlyName="Savior"
LocFlyOverText="Savior"
LocLongDescription="Healing abilities restore <Ability:SAVIOR_BONUS_HEAL_AMMOUNT> additional hit points."
LocHelpText="Healing abilities restore <Ability:SAVIOR_BONUS_HEAL_AMMOUNT> additional hit points."
LocPromotionPopupText="<Bullet/> Effect applies to GREMLIN heal, Medikits and Restoration abilities.<br/>"

[LW2WotC_HeavyOrdnance X2AbilityTemplate]
LocFriendlyName="Heavy Ordnance"
LocLongDescription="Any damaging grenade in your grenade-only slot gains <Ability:HEAVY_ORDNANCE_BONUS_CHARGES> bonus use."
LocHelpText="Any damaging grenade in your grenade-only slot gains <Ability:HEAVY_ORDNANCE_BONUS_CHARGES> bonus use."
LocFlyOverText="Heavy Ordnance"
LocPromotionPopupText="<Bullet/> All damaging grenades are viable for Heavy Ordnance.<br/>"

[LW2WotC_Protector X2AbilityTemplate]
LocFriendlyName="Protector"
LocLongDescription="Any non-damaging grenade in your grenade-only slot gains <Ability:PROTECTOR_BONUS_CHARGES> bonus use."
LocHelpText="Any non-damaging grenade in your grenade-only slot gains <Ability:PROTECTOR_BONUS_CHARGES> bonus use."
LocFlyOverText="Protector"
LocPromotionPopupText="<Bullet/> All non-damaging grenades except Ghost Grenades are viable for Protector.<br/>"

[LW2WotC_HEATWarheads X2AbilityTemplate]
LocFriendlyName="HEAT Warheads"
LocLongDescription="Your grenades now pierce up to <Ability:HEAT_WARHEADS_PIERCE> points of armor and shred <Ability:HEAT_WARHEADS_SHRED> additional point of armor."
LocHelpText="Your grenades now pierce up to <Ability:HEAT_WARHEADS_PIERCE> points of armor and shred <Ability:HEAT_WARHEADS_SHRED> additional point of armor."
LocFlyOverText="HEAT Warheads"
LocPromotionPopupText="<Bullet/> Your grenades now pierce (ignore) up to <Ability:HEAT_WARHEADS_PIERCE> points of armor and shred <Ability:HEAT_WARHEADS_SHRED> additional point of armor.<br/>"

[LW2WotC_Suppression X2AbilityTemplate]
LocFriendlyName="Suppression"
LocFlyOverText="Suppression"
LocLongDescription="Fire a barrage that pins down a target, grants reaction fire against it if it moves, restricts the use of many abilities, and imposing a <Ability:SUPPRESSIONPENALTY/> penalty to the target's aim."
LocHelpText="Penalize target's aim and shoot them if they move."
LocPromotionPopupText="<Bullet/> Suppression costs <Ability:SelfAmmoCost/> ammo points to use, but has no cooldown.<br/><Bullet/> Suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> If multiple units suppress a target, the aim penalty will stack.<br/><Bullet/> May not be used if sniper rifle or shotgun-class weapons are equipped.<br/><Bullet/> Suppression restricts many of the target's abilities, including the use of rockets and grenades."

[LW2WotC_AreaSuppression X2AbilityTemplate]
LocFriendlyName="Area Suppression"
LocFlyOverText="Area Suppression"
LocLongDescription="Fire a barrage that pins down multiple targets within a 4-tile radius, granting reaction fire against anyone that moves, and imposing a <Ability:SUPPRESSIONPENALTY/> penalty to all targets' aim until suppression is removed. Cannot be used when concealed."
LocHelpText="Suppress multiple targets within an area of effect."
LocPromotionPopupText="<Bullet/> Area Suppression cannot be used when the soldier is concealed.<br/><Bullet/> Any unit that attempts to move will face reaction fire as long as the suppressing unit has ammo remaining.<br/><Bullet/> Does not work with shotguns or sniper rifles.<br/><Bullet/> Area Suppression costs <Ability:SelfAmmoCost/> ammo points to use, plus one additional ammo for each reaction shot. It has no cooldown.<br/><Bullet/> Area suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> If multiple units suppress a target, the aim penalty will stack.<br/><Bullet/> Suppression restricts many of the target's abilities, including the use of rockets and grenades.""

[LW2WotC_SuppressionShot X2AbilityTemplate]
LocFriendlyName="Suppression"
LocFlyOverText="Suppression"

[LW2WotC_DangerZone X2AbilityTemplate]
LocFriendlyName="Danger Zone"
LocFlyOverText="Danger Zone"
LocLongDescription="Area Suppression suppresses enemies in a 5-tile radius."
LocHelpText="Wider Area Suppression."
LocPromotionPopupText="<Bullet/> Area Suppression suppresses enemies in a 5-tile radius.<br/>

[LW2WotC_Lockdown X2AbilityTemplate]
LocFriendlyName="Lockdown"
LocFlyOverText="Lockdown"
LocLongDescription="Gain +<Ability:LOCKDOWN_TOHIT_BONUS> to hit against enemies who attempt to move when suppressed."
LocHelpText="Bonus hit chance and damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain +<Ability:LOCKDOWN_TOHIT_BONUS> to hit against enemies who attempt to move when suppressed.<br/><Bullet/> This stacks with other reaction fire bonuses."

[LW2WotC_Lockdown_Bonuses X2AbilityTemplate]
LocFriendlyName="Lockdown"
LocFlyOverText="Lockdown"
LocLongDescription="Gain +<Ability:LOCKDOWN_TOHIT_BONUS> to hit against enemies who attempt to move when suppressed."
LocHelpText="Bonus hit chance and damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain +<Ability:LOCKDOWN_TOHIT_BONUS> to hit against enemies who attempt to move when suppressed.<br/><Bullet/> This stacks with other reaction fire bonuses."

[LW2WotC_Mayhem X2AbilityTemplate]
LocFriendlyName="Mayhem"
LocFlyOverText="Mayhem"
LocLongDescription="Gain <Ability:MAYHEM_DAMAGE_BONUS_PCT>% bonus damage against enemies who attempt to move when suppressed."
LocHelpText="Bonus damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain <Ability:MAYHEM_DAMAGE_BONUS_PCT>% bonus damage against enemies who attempt to move when suppressed.<br/>"

[LW2WotC_Mayhem_Bonuses X2AbilityTemplate]
LocFriendlyName="Mayhem"
LocFlyOverText="Mayhem"
LocLongDescription="Gain <Ability:MAYHEM_DAMAGE_BONUS_PCT>% bonus damage against enemies who attempt to move when suppressed."
LocHelpText="Bonus damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain <Ability:MAYHEM_DAMAGE_BONUS_PCT>% bonus damage against enemies who attempt to move when suppressed.<br/>"

[LW2WotC_EmergencyLifeSupport X2AbilityTemplate]
LocFriendlyName="Emergency Life Support"
LocFlyOverText="Emergency Life Support"
LocLongDescription="Emergency Life Support ensures the first killing blow in a mission will not lead to instant death. It also extends the time before the soldier bleeds out and dies."
LocHelpText="Ensures the first killing blow in a mission will not lead to instant death and extends bleed-out time."
LocPromotionPopupText="<Bullet/> Emergency Life Support makes the first check for bleeding out each mission an automatic success.<br/><Bullet/> Adds two turns to the bleedout timer.<br/>"

[LW2WotC_SmartMacrophages X2AbilityTemplate]
LocFriendlyName="Smart Macrophages"
LocFlyOverText="Smart Macrophages"
LocLongDescription="Heals injuries after a battle, lowering wound recovery time, and confers immunity to poison and acid."
LocHelpText="Lowers wound recovery time and confers immunity to poison and acid."
LocPromotionPopupText="<Bullet/> The number of hit points you lost during a battle, which is used to calculate time out wounded, is reduced by one.<br/><Bullet/> You are immune to poison and acid.<br/>"

[LW2WotC_FieldSurgeon X2AbilityTemplate]
LocFriendlyName="Field Surgeon"
LocFlyOverText="Field Surgeon"
LocLongDescription="Reduce wound recovery times for most soldiers."
LocHelpText="Reduce wound recovery times for most soldiers."
LocPromotionPopupText="<Bullet/> Field Surgeon reduces the number of hit points a soldier must heal after being wounded in battle by 1.<br/><Bullet/> Multiple Field Surgeons on a mission have a chance to reduce wound recovery time further.<br/><Bullet/> The effect includes the soldier with the ability.<br/><Bullet/> It does not affect soldiers who suffered killing wounds and are stabilized from bleeding out."

[LW2WotC_Trojan X2AbilityTemplate]
LocFriendlyName="Trojan"
LocFlyOverText="Trojan"
LocLongDescription="Enemy units that are hacked take damage and lose their actions on the turn the hack effect ends."
LocHelpText="Hacked units suffer damage and action loss when hack effect ends."
LocPromotionPopupText="<Bullet/> Enemy units hacked by Haywire Protocol take 0 to 8 damage and lose their actions on the turn the hack effect ends.<br/><Bullet/> Applies to units stunned or taken over by Haywire Protocol.<br/><Bullet/> Damage calculated based on Hacking Stat vs. target's Hack Defense.<br/>"

[LW2WotC_IronCurtain X2AbilityTemplate]
LocFriendlyName="Iron Curtain"
LocFlyOverText="Iron Curtain"
LocLongDescription="Special shot that does <Ability:IRON_CURTAIN_DAMAGE_MODIFIER>% damage but reduces target mobility for the following <Ability:IRON_CURTAIN_MOB_DAMAGE_DURATION> turns. Cone-based attack with primary weapon. <Ability:IRON_CURTAIN_COOLDOWN> turn cooldown."
LocHelpText="Special shot that does low damage but reduces enemy mobility for the following <Ability:IRON_CURTAIN_MOB_DAMAGE_DURATION> turns."
LocPromotionPopupText="<Bullet/> If this cone-based attack hits, Iron Curtain does <Ability:IRON_CURTAIN_DAMAGE_MODIFIER>% normal damage and imposes -<Ability:IRON_CURTAIN_MOBILITY_DAMAGE> mobility to the enemy for <Ability:IRON_CURTAIN_MOB_DAMAGE_DURATION> turns.<br/><Bullet/> <Ability:IRON_CURTAIN_COOLDOWN> turn cooldown.<br/><Bullet/> Uses <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Can be used after moving.<br/><Bullet/> Iron Curtain does not work with shotguns or sniper rifles.<br/><Bullet/> Allies in the cone can be hit by this ability.<br/>"

[LW2WotC_BodyShield X2AbilityTemplate]
LocFriendlyName="Body Shield"
LocFlyOverText="Body Shield"
LocLongDescription="A targeted enemy receives -<Ability:BODY_SHIELD_DEF_BONUS> aim and -<Ability:BODY_SHIELD_ENEMY_CRIT_MALUS> critical chance against the soldier. <Ability:BODY_SHIELD_COOLDOWN> turn cooldown."
LocHelpText="The targeted enemy receives -<Ability:BODY_SHIELD_DEF_BONUS> aim and -<Ability:BODY_SHIELD_ENEMY_CRIT_MALUS> critical chance against the soldier. <Ability:BODY_SHIELD_COOLDOWN> turn cooldown."
LocPromotionPopupText="<Bullet/> A targeted enemy receives -<Ability:BODY_SHIELD_DEF_BONUS> aim and -<Ability:BODY_SHIELD_ENEMY_CRIT_MALUS> critical chance against the soldier.<br/><Bullet /> <Ability:BODY_SHIELD_COOLDOWN> turn cooldown.<br/>"

[LW2WotC_StingGrenades X2AbilityTemplate]
LocFriendlyName="Sting Grenades"
LocFlyOverText="Sting Grenades"
LocLongDescription="Your flashbang grenades have a <Ability:STING_GRENADE_STUN_CHANCE>% chance to stun enemies for one turn in the flashbang's Area of Effect."
LocHelpText="Your flashbang grenades have a <Ability:STING_GRENADE_STUN_CHANCE>% chance to stun enemies."
LocPromotionPopupText="<Bullet/> Your flashbang grenades have a <Ability:STING_GRENADE_STUN_CHANCE>% chance to stun enemies.<br/>"

[LW2WotC_BluescreenBombs X2AbilityTemplate]
LocFriendlyName="Bluescreen Bombs"
LocLongDescription="Your flashbang grenades now disorient robotic units and reduce their resistance to hacking."
LocHelpText="Your flashbang grenades now disorient robotic units and reduce their resistance to hacking."
LocFlyOverText="Bluescreen Bombs"
LocPromotionPopupText="<Bullet/> Your flashbang grenades now disorient robotic units.<br/><Bullet/> Your flashbang grenades also reduce robotic hack defense.<br/>"

[LW2WotC_ImpactFields X2AbilityTemplate]
LocFriendlyName="Impact Fields"
LocFlyOverText="Impact Fields"
LocLongDescription="Activate a force field that reduces incoming damage by <Ability:IMPACT_FIELDS_DAMAGE_REDUCTION_PCT>% for <Ability:IMPACT_FIELDS_DURATION> turns. <Ability:IMPACT_FIELDS_COOLDOWN> turn cooldown."
LocHelpText="Activate a force field that reduces incoming damage by <Ability:IMPACT_FIELDS_DAMAGE_REDUCTION_PCT>% for <Ability:IMPACT_FIELDS_DURATION> turns. <Ability:IMPACT_FIELDS_COOLDOWN> turn cooldown."
LocPromotionPopupText="<Bullet/> Activate a force field that reduces incoming damage by <Ability:IMPACT_FIELDS_DAMAGE_REDUCTION_PCT>% for <Ability:IMPACT_FIELDS_DURATION> turns.<br/><Bullet/> <Ability:IMPACT_FIELDS_COOLDOWN> turn cooldown (including the turn in which it was activated).<br/><Bullet/> Uses one action and doesn't automatically end your turn.<br/><Bullet/> Armor-Piercing weapons do not mitigate this effect.<br/>"

[LW2WotC_DoubleTap X2AbilityTemplate]
LocFriendlyName="Double Tap"
LocFlyOverText="Double Tap"
LocLongDescription="Activate to fire a standard shot and gain a second action restricted to an additional shot or overwatching."
LocHelpText="Fire a standard shot and gain a bonus shot or overwatch action."
LocPromotionPopupText="<Bullet/> Activate to fire a standard shot and gain a second action restricted to Standard Shot, Precision Shot, Kubikiri or Overwatch.<br/><Bullet/> <Ability:SelfCooldown/>-turn cooldown.<br/>"

[LW2WotC_SnapShot X2AbilityTemplate]
LocFriendlyName="Snap Shot"
LocFlyOverText="Snap Shot"
LocHelpText="Shoot the target."
LocLongDescription="You may take standard shots with your sniper rifle after moving, but you suffer severe range penalties beyond 5 tiles of squadsight range."
LocPromotionPopupText="<Bullet/> The soldier may now use the sniper rifle for standard shots after moving, but suffers extreme aim penalties at targets beyond 22 tiles range on those shots.<br/><Bullet/> The soldier may not enter overwatch with the sniper rifle after moving.<br/>

[LW2WotC_SnapShotAimModifier X2AbilityTemplate]
LocFriendlyName="Snap Shot"
LocFlyOverText="Snap Shot"
LocLongDescription="You may take standard shots and enter standard overwatch with your sniper rifle after moving, but you suffer severe range penalties beyond 5 tiles of squadsight range on all shots."
LocHelpText="Allows standard shots and overwatch with sniper rifles after moving."

[LW2WotC_Whirlwind X2AbilityTemplate]
LocFriendlyName="Whirlwind"
LocLongDescription="If you hit with a melee attack during your turn, gain a bonus move."
LocHelpText="Gain one bonus move action after a successful melee attack."
LocFlyOverText="Whirlwind"
LocPromotionPopupText="<Bullet/> A soldier can only gain one move per turn with this ability.<br/><Bullet/> Cannot be employed if Reaper or Serial are active.<br/>"

[LW2WotC_GhostGrenade X2AbilityTemplate]
LocFriendlyName="Ghost Grenade"
LocLongDescription="A specialized smoke grenade that causes the targeted ally to enter concealment."
LocHelpText="Put a single XCOM ally into concealment."
LocPromotionPopupText="<Bullet/> This ability only affects a single targeted ally; others in the smoke cloud are not concealed but do receive the defense bonus.<br/><Bullet/> Uses one action and ends your turn.<br/><Bullet/> One use per mission; abilities that add grenade charges do not provide any bonuses.<br/><Bullet/> Only works on XCOM soldiers, as civilians do not have training in concealment techniques.<br/><Bullet/> Small smoke cloud grants 20 defense; dense smoke bonuses do not apply.<br/><Bullet/> It does not fit in the standard XCOM grenade launcher and must be thrown at a visible ally.<br/><Bullet/> The Grenadier cannot use this ability when concealed."

[VanishingAct X2AbilityTemplate]
LocFriendlyName="Ghost Grenade"
LocHelpText="Specialized smoke grenade that puts an ally in concealment inside a small cloud of smoke."
LocFlyOverText="Ghost Grenade"

[LW2WotC_Flush X2AbilityTemplate]
LocFriendlyName="Flush"
LocLongDescription="Special shot with a bonus to hit that does little or no damage but confers defense and dodge penalties and forces target to change position if it hits."
LocHelpText="Special shot that does little or no damage but confers defense and dodge penalties and forces target to change position."
LocFlyOverText="Flush"
LocPromotionPopupText="<Bullet/> Consumes <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> <Ability:FLUSH_COOLDOWN> turn cooldown.<br/><Bullet/> +<Ability:FLUSH_AIM_BONUS> bonus to aim.<br/><Bullet/> Cannot crit or apply bonus ammo effects.<br/><Bullet/> Cannot be used from concealment.<br/><Bullet/> Target loses <Ability:FLUSH_DEFENSE_REDUCTION> defense and <Ability:FLUSH_DODGE_REDUCTION> dodge until the start of XCOM's next turn."
str_FlushEffect="Flushed"

[LW2WotC_ClutchShot X2AbilityTemplate]
LocFriendlyName="Clutch Shot"
LocFlyOverText="Clutch Shot"
LocLongDescription="Once per mission, fire a pistol shot that cannot miss."
LocHelpText="Once per mission, fire a pistol shot that cannot miss."
LocPromotionPopupText="<Bullet/> Once per mission, fire a pistol shot that cannot miss.<br/>"

[FullOverride X2AbilityTemplate]
LocFriendlyName="Full Override"
LocLongDescription="Take permanent control of a robotic unit and potentially acquire ADVENT MECs for the Resistance."
LocHelpText="Take permanent control of a robotic unit and potentially acquire ADVENT MECs for the Resistance."
LocFlyOverText="Full Override"
LocPromotionPopupText="<Bullet/> Full Override is a special hack action usable against enemy robotic units.<br/><Bullet/> It has one charge that is only expended if a successful override occurs.<br/><Bullet/> Requires one action and ends the soldier's turn.<br/><Bullet/> The first hack option, Command Enemy, will grant control of the robotic unit for the duration of the mission.<br/><Bullet/> The second hack option, Master Enemy, also grants a stat bonus for the rest of the mission for all robots, and will permanently transfer any MEC units to the Resistance.<br/><Bullet/> If the Master Enemy hack succeeds, and the MEC and the specialist both survive the mission, the MEC will follow new programming and make its way to a Resistance base, where it will serve the Resistance. It does not need to be evacuated when the mission ends."

[BuffEnemy_FullOverride X2HackRewardTemplate]
FriendlyName="Overdrive"
Description="A failed hack will increase this target's Aim and Defense stats."

[ControlRobot_Mission X2HackRewardTemplate]
FriendlyName="Command Enemy"
Description="Take control of this unit for rest of the mission."

[LW2WotC_Gunslinger X2AbilityTemplate]
LocFriendlyName="Gunslinger"
LocFlyOverText="Gunslinger"
LocLongDescription="Take a reaction shot with your pistol against any enemy that moves or attacks within <Ability:GUNSLINGER_TILES_RANGE> tiles and a wide cone of fire. <Ability:GUNSLINGER_COOLDOWN> turn cooldown."
LocHelpText="Enhanced pistol overwatch in a cone of fire."
LocPromotionPopupText="<Bullet/> Range is <Ability:GUNSLINGER_TILES_RANGE> tiles.<br/><Bullet/> <Ability:GUNSLINGER_COOLDOWN> turn cooldown.<br/>"

[LW2WotC_Commissar X2AbilityTemplate]
LocFriendlyName="Commissar"
LocFlyOverText="Commissar"
LocLongDescription="Pistol shots against allies who have been mind-controlled by enemies have +<Ability:COMMISSAR_HIT_BONUS> to hit, cannot be dodged, and automatically kill the target if a hit occurs."
LocHelpText="Pistol shots against allies who have been mind-controlled by enemies have +<Ability:COMMISSAR_HIT_BONUS> to hit, cannot be dodged, and automatically kill the target if a hit occurs."
LocPromotionPopupText="<Bullet/> Pistol shots against allies who have been mind-controlled by enemies have +<Ability:COMMISSAR_HIT_BONUS> to hit, cannot be dodged, and automatically kill the target if a hit occurs.<br/>"

[LW2WotC_SteadyWeapon X2AbilityTemplate]
LocFriendlyName="Steady Weapon"
LocFlyOverText="Steady Weapon"
LocLongDescription="Gain +<Ability:STEADY_WEAPON_AIM_BONUS> aim on your next shot with your primary weapon. Multiple uses will stack bonus. Bonus is lost if you use actions or are wounded."
LocHelpText="Gain +<Ability:STEADY_WEAPON_AIM_BONUS> aim on your next shot with your primary weapon. Multiple uses will stack bonus. Bonus is lost if you use actions or are wounded."
LocPromotionPopupText="<Bullet/> Gain +<Ability:STEADY_WEAPON_AIM_BONUS> aim on your next shot with your primary weapon. Bonus is lost if you use actions or are wounded.<br/><Bullet/> Cannot Steady Weapon when suppressed.<br/><Bullet/> Effect will persist through multiple turns if you do nothing.<br/><Bullet/> Using Steady Weapon over multiple consecutive turns will allow the bonus to stack."

[LW2WotC_Bombardier X2AbilityTemplate]
LocFriendlyName="Bombardier"
LocLongDescription="You may throw or launch grenades <Ability:BOMBARDIER_BONUS_RANGE_TILES> additional tiles."
LocHelpText="You may throw or launch grenades <Ability:BOMBARDIER_BONUS_RANGE_TILES> additional tiles."
LocFlyOverText="Bombardier"
LocPromotionPopupText="<Bullet/> Your grenades have <Ability:BOMBARDIER_BONUS_RANGE_TILES> tiles extra range.<br/><Bullet/> This includes either launched or thrown grenades.<br/><Bullet/> This also includes Battlescanners.<br/>"

[LW2WotC_Failsafe X2AbilityTemplate]
LocFriendlyName="Failsafe"
LocLongDescription="If you fail a hack, you prevent any negative effects from occurring."
LocHelpText="If you fail a hack, you prevent any negative effects from occurring."
LocFlyOverText="Failsafe"
LocPromotionPopupText="<Bullet/> If you fail a hack, you prevent any negative effects from occurring."

[LW2WotC_MindMerge X2AbilityTemplate]
LocFriendlyName="Mind Merge"
LocFlyOverText="Mind Merge"
LocLongDescription="Grants bonus will, critical chance and ablative hit points to an ally until the beginning of the player's next turn."
LocHelptext="Temporarily grants bonus will, critical chance and ablative hit points to an ally."
LocPromotionPopupText="<Bullet/> Grants the targeted ally 1 ablative (shield) hit point, plus another one per <Ability:MIND_MERGE_SHIELDHP_DIVISOR> psi offense score of the Psi Operative using Mind Merge.<br/><Bullet/> Grants the targeted ally 1 will per <Ability:MIND_MERGE_WILL_DIVISOR> psi offense score of the Psi Operative.<br/><Bullet/> Also grants the ally +1 critical chance per <Ability:MIND_MERGE_CRIT_DIVISOR> psi offense score of the Psi Operative.<br/><Bullet/> Effect lasts until the Psi Operative's next turn.<br/><Bullet/> <Ability:MIND_MERGE_COOLDOWN> turn cooldown.<br/><Bullet/> Only visible allies may be targeted.<br/><Bullet/> Improved Psi Amps grant additional bonuses to these effects.<br/><Bullet/> Requires one action."

[LW2WotC_SoulMerge X2AbilityTemplate]
LocFriendlyName="Soul Merge"
LocFlyOverText="Soul Merge"
LocLongDescription="Increases effectiveness of Mind Merge by conferring larger bonuses to critical chance, will and ablative hit points, and reducing its cooldown period."
LocHelpText="Increases effectiveness of Mind Merge."
LocPromotionPopupText="<Bullet/> Reduces Mind Merge cooldown by <Ability:SOUL_MERGE_COOLDOWN_REDUCTION> turn.<br/><Bullet/> Bonus ablative Hit Points improves to 1 per <Ability:SOUL_MERGE_SHIELDHP_DIVISOR> psi offense score.<br/><Bullet/> Bonus will improves to 1 per <Ability:SOUL_MERGE_WILL_DIVISOR> psi offense score.<br/><Bullet/> Grants a crit bonus of 1% per <Ability:SOUL_MERGE_CRIT_DIVISOR> psi offense."

[XComGame.UIArmory_Loadout]
[UIArmory_Loadout]
m_strNeedsSoldierClass="CANNOT EQUIP"
m_strUnavailableToClass="UNAVAILABLE"
